{
  "by": "maelito",
  "descendants": 68,
  "id": 22702311,
  "kids": [
    {
      "by": "tyingq",
      "id": 22703890,
      "kids": [
        {
          "by": "mavsman",
          "id": 22706234,
          "kids": [
            {
              "by": "KajMagnus",
              "id": 22725841,
              "text": "Yes, look here, CodingHorror&#x27;s (Jeff Atwood) blog:<p><a href=\"https:&#x2F;&#x2F;blog.codinghorror.com&#x2F;the-rise-of-the-electric-scooter&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.codinghorror.com&#x2F;the-rise-of-the-electric-scoot...</a><p>the comments in the comments section, are from Discourse. Here&#x27;s that Discourse forum: <a href=\"https:&#x2F;&#x2F;discourse.codinghorror.com&#x2F;t&#x2F;the-rise-of-the-electric-scooter&#x2F;7016&#x2F;40\" rel=\"nofollow\">https:&#x2F;&#x2F;discourse.codinghorror.com&#x2F;t&#x2F;the-rise-of-the-electri...</a><p>A difference between Talkyard and Discourse, for blog comments, is that Talkyard is threaded, like Disqus. So when people start talking about different things related to the blog post — start different &quot;sub topics&quot;, then, with Talkyard, each such sub topic gets its own sub thread,<p>... Whilst with Discourse, all sub topics are mixed together into one single flat layout.<p>And, with Talkyard and Disqus etc, the more interesting (more popular) sub topics are shown first, whilst with Discourse, it&#x27;s whoever happened to type the first comment, who is shown first.",
              "time": 1585552080
            }
          ],
          "text": "I believe Discourse can do this as well, as least they did something like it for a while on their blog posts.",
          "time": 1585339057
        },
        {
          "by": "KajMagnus",
          "id": 22704113,
          "kids": [
            {
              "by": "tyingq",
              "id": 22704122,
              "kids": [
                {
                  "by": "KajMagnus",
                  "id": 22704199,
                  "text": "Getting started, from the point of view of a site admin &#x2F; moderator?<p>(Rather than how to install the software? For that I hope the readme file works ok.)<p>Hmm, you mentioned Scala and the JVM — I&#x27;m wondering if you have in mind &quot;Getting started&quot; with editing the source code<p>(I&#x27;m curious about what forum software you used in the past, as an admin, and how did you like it?)",
                  "time": 1585326015
                }
              ],
              "text": "No worries.  I was just curious, having done some forum admin in the past...how you approached spam. I would guess a &quot;getting started&quot; doc would be the #1 priority.  Especially since the server is Scala, and many may not have worked with a JVM.",
              "time": 1585325480
            },
            {
              "by": "AzzieElbab",
              "id": 22708856,
              "kids": [
                {
                  "by": "KajMagnus",
                  "id": 22725894,
                  "text": "I&#x27;m making a list of API things to document right now :- )<p>Any special API things &#x2F; features you&#x27;d be interested in? E.g. API for doing X or integrating with Y?<p>(I&#x27;ve fixed the &quot;e2e-test-&quot; prefix problem, will deploy in a few days. Was unintentional — I would have removed the &quot;Create test site&quot; link instead)",
                  "time": 1585552839
                }
              ],
              "text": "Pretty awesome, what about APIs? Also there is a problem&#x2F;bug in creating test sites. &quot;Site name has to start with e2e-test...&quot; but no way to enter that prefix. Might temporarily intentional",
              "time": 1585364710
            }
          ],
          "text": "Sorry, there is barely any documentation yet.<p>What things would you want me to focus on, when adding documentation?<p>(How would you like to use it &#x2F; maybe integrate with sth else?)",
          "time": 1585325382
        },
        {
          "by": "jasonv",
          "id": 22704054,
          "kids": [
            {
              "by": "KajMagnus",
              "id": 22704169,
              "kids": [
                {
                  "by": "vthriller",
                  "id": 22707516,
                  "kids": [
                    {
                      "by": "KajMagnus",
                      "id": 22725802,
                      "kids": [
                        {
                          "by": "vthriller",
                          "id": 22731357,
                          "kids": [
                            {
                              "by": "KajMagnus",
                              "id": 22737086,
                              "text": "A bunch of interesting things going on at that forum, Opennet.ru&#x2F;forum :- )<p>Nice to be able to &quot;preview&quot; a discussion directly on the topic list page, and interesting shortcuts the forum has:<p><pre><code>    Открыть первые 10.  — Open the first 10. (I used Google Translate)\n    Открыть последние комментарии. — View recent comments.\n    Раскрыть ответы 1 уровня. — Expand Level 1 Answers.\n    Линейный вид. — Linear view.\n</code></pre>\nSth like the expand-level-1-answers button is something people have suggested for Talkyard too.<p>&gt; It is [...] enough for most users most of the time<p>Ok, thanks, interesting to know",
                              "time": 1585659939
                            }
                          ],
                          "text": "&gt;  It&#x27;d be interesting to have a look at that news site forum (if you have a link?).<p>I doubt that you will find it particularly useful (site in Russian, and I&#x27;ve no idea how reliably that feature works for unregistered users), but anyway: <a href=\"https:&#x2F;&#x2F;www.opennet.ru&#x2F;forum&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.opennet.ru&#x2F;forum&#x2F;</a><p>&gt; I wonder how they determine which messages are new. Maybe it&#x27;s [new since one&#x27;s last visit]?<p>It is. While not as powerful as status tracking for individual messages (can&#x27;t skip some messages for future read as easily, can&#x27;t mark message as unread etc.), it is enough for most users most of the time.",
                          "time": 1585596204
                        }
                      ],
                      "text": "It&#x27;d be interesting to have a look at that news site forum (if you have a link?).<p>&gt; messages are folding individually (i.e. only content is hidden but not the children)<p>Seems like a nice way to give a concise overview of the discussion (who replies to who, how long each thread is).  I think it&#x27;d be nice to see the first rows of each message, so one knows what it is about (maybe one has forgotten).<p>&gt; only new messages are shown in an unfolded state<p>(So that one directly sees the messages one hasn&#x27;t read before, and can start reading them effortlessly, right)<p>&gt; only new messages are shown<p>I wonder how they determine which messages are new. Maybe it&#x27;s [new since one&#x27;s last visit]? Or messages one hasn&#x27;t read yet? Not that easy to know which messages the visitor has read, if many messages are visible on the screen at the same time :- )",
                      "time": 1585551348
                    }
                  ],
                  "text": "Re: finding new comments, I&#x27;ve seen another solution on one of the news site forums that I quite liked: messages are folding individually (i.e. only content is hidden but not the children), and when you enter the thread through the &quot;new&quot; link, only new messages are shown in an unfolded state.",
                  "time": 1585348371
                },
                {
                  "by": "jasonv",
                  "id": 22704336,
                  "kids": [
                    {
                      "by": "KajMagnus",
                      "id": 22726041,
                      "text": "&gt; forum&#x2F;discussion for a non-technical audience<p>How interesting — what would your community be about? (if I may ask)<p>Non-tech people is a long term goal with Talkyard.<p>As of now, though, I&#x27;m thinking none of Talkyard or Discourse or Flarum (did you know about Flarum? <a href=\"https:&#x2F;&#x2F;flarum.org\" rel=\"nofollow\">https:&#x2F;&#x2F;flarum.org</a>) or Nodebb are particularly easy to use, for non-tech people? E.g. Markdown for formatting text, and navigating between topics and categories, feel confusing to me.<p>&gt; Discourse [...] the plug-ins they support, and the wiki topic element, the ability to theme it, and the ability to limit or lock categories based on karma and groups<p>Some of those things, but not all, work with Talkyard: 1) Wiki topics &#x2F; categories — yes, by configuring category permissions (see this reply here: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=22704726\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=22704726</a> ). 2) Locking categories based on groups and trust levels — yes (see the same link). 3) Plugins: No, unfortunately not. I think there&#x27;ll will be a WebAssembly based plugin system in the distant future. 4) Theming: Can be done but not so easy — one needs to write CSS code. A theme &amp; colors editor is planned.<p>&gt; liked some of the plug-ins they support<p>I&#x27;m curious about which plugins :- )",
                      "time": 1585554668
                    }
                  ],
                  "text": "Thanks for the links. Will dig in more.<p>I&#x27;m looking to build a forum&#x2F;discussion for a non-technical audience with some of the policies that HN has implemented well... community will be non-monetized, but it&#x27;ll be connected to a separate, sponsoring monetization channel.<p>I&#x27;ve not actually spent a lot of time on a Discourse forum, but have liked some of the plug-ins they support, and the wiki topic element, the ability to theme it, and the ability to limit or lock categories based on karma and groups. FYI on where I&#x27;m coming from.",
                  "time": 1585326852
                }
              ],
              "text": "Then maybe you&#x27;d find this interesting: <a href=\"https:&#x2F;&#x2F;www.talkyard.io&#x2F;-32&#x2F;how-hacker-news-can-be-improved-3-things\" rel=\"nofollow\">https:&#x2F;&#x2F;www.talkyard.io&#x2F;-32&#x2F;how-hacker-news-can-be-improved-...</a> <i>&quot;How Hacker News [or Reddit] can be improved&quot;</i><p>(If &#x2F; when you find things that don&#x27;t work like you want, I&#x27;d be happy for any feedback: <a href=\"https:&#x2F;&#x2F;www.talkyard.io&#x2F;forum&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.talkyard.io&#x2F;forum&#x2F;</a> )",
              "time": 1585325775
            }
          ],
          "text": "I&#x27;m in the market for something like this right now... a reddit&#x2F;discourse hybrid.<p>Will check this out.",
          "time": 1585325004
        }
      ],
      "text": "The ability to function as either a standalone forum, or as a disqus style comment add on for an existing blog is neat.<p>Is there documentation somewhere? I can see it has some kind of spam protection by skimming the source code, but I don&#x27;t see any docs.",
      "time": 1585324095
    },
    {
      "by": "einpoklum",
      "id": 22704537,
      "kids": [
        {
          "by": "closeparen",
          "id": 22704652,
          "text": "Mamute is a FOSS StackOverflow: <a href=\"https:&#x2F;&#x2F;www.mamute.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mamute.org&#x2F;</a>",
          "time": 1585328886
        },
        {
          "by": "kossae",
          "id": 22705726,
          "kids": [
            {
              "by": "einpoklum",
              "id": 22705782,
              "text": "It&#x27;s still in a very early stage. But there&#x27;s a forum with a bunch of activity, and it sounds like people are writing code.",
              "time": 1585335834
            }
          ],
          "text": "Looking at that homepage, I have zero idea about what it does or even looks like. It seems to be all mission statement fluff and no description of the actual tool.",
          "time": 1585335529
        }
      ],
      "text": "That&#x27;s not a FOSS StackOverflow, it&#x27;s a cross between several platforms.<p>For those interested, There&#x27;s already another initiative for a free, non-commercial, community-governed StackExchange alternative, called codidact: <a href=\"https:&#x2F;&#x2F;codidact.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;codidact.org&#x2F;</a><p>I don&#x27;t know that it&#x27;s good (or bad), I just know there&#x27;s been planning work going on around it, following the recent upheavals and resignations on the StackExchange network.",
      "time": 1585328096
    },
    {
      "by": "miker64",
      "id": 22705021,
      "kids": [
        {
          "by": "KajMagnus",
          "id": 22706451,
          "text": "Thanks. (I suppose it&#x27;s still a bit biased — not so easy for me to be completely impartial.)<p>(And also I&#x27;m less familiar with those other tools; there&#x27;re good things about them that I don&#x27;t know about)",
          "time": 1585340389
        }
      ],
      "text": "Gets points with me for honesty in the comparisions page (<a href=\"https:&#x2F;&#x2F;www.talkyard.io&#x2F;compared-with\" rel=\"nofollow\">https:&#x2F;&#x2F;www.talkyard.io&#x2F;compared-with</a>)",
      "time": 1585331157
    },
    {
      "by": "bearjaws",
      "id": 22704412,
      "kids": [
        {
          "by": "KajMagnus",
          "id": 22706647,
          "text": "And emails too? :- )<p>Looking at your list of tools, seems to me GitLab will stay &quot;forever&quot;, and... Mattermost is probably always going to be a better chat,<p>I&#x27;m thinking maybe a Mattermost + Talkyard (+ Gitlab?) integration somehow, could make sense<p>What about Sharepoint, you use it for document management?",
          "time": 1585341560
        },
        {
          "by": "pepemon",
          "id": 22704808,
          "kids": [
            {
              "by": "apocalyptic0n3",
              "id": 22707367,
              "text": "Space looks super promising, but I looked at the EAP in late January and it seemed far from ready for actual use. It seemed like it needed another year in development to flesh everything out. I really hope it comes together like they plan for it to. It&#x27;d be nice to switch from our stack of Redmine, 2 instances of GitLab, Slack, and a custom wiki solution.",
              "time": 1585346939
            }
          ],
          "text": "Have a look at JetBrains Space.",
          "time": 1585329781
        }
      ],
      "text": "Love the idea overall, at my job we have a total mess of Jira + Gitlab + Confluence + Confluence Questions + Sharepoint + Mattermost.<p>I believe there are efficiency gains to be had from having a unified platform that is self hosted.",
      "time": 1585327320
    },
    {
      "by": "aklemm",
      "id": 22704577,
      "kids": [
        {
          "by": "KajMagnus",
          "id": 22714369,
          "text": "From what I&#x27;ve heard, people like the auto self-upgrade feature.<p>No Activity Pub support, ...<p>... It&#x27;d be nice if some day in the future, Talkyard could pull in toots (tweets) from Mastodon and show as posts in a discussion forum topic, or as blog post comments (after having been approved by a moderator).<p>What Fediverse software do you use the most? Like the most?",
          "time": 1585429953
        }
      ],
      "text": "Anyone know how the self-hosting experience is? Also whether it has Activity Pub support? If this reaches it&#x27;s potential, it would be great if it were part of the Fediverse.",
      "time": 1585328403
    },
    {
      "by": "xvilka",
      "id": 22708716,
      "kids": [
        {
          "by": "KajMagnus",
          "id": 22726071,
          "text": "&gt; Why not implement similar things in Go?<p>Yes that&#x27;s what I would have done, if I were to start this project now. Well, not Go, but Rust.",
          "time": 1585555184
        }
      ],
      "text": "&gt; You need about 6 GB RAM for the development environment (whereas the production environment needs about 2 GB). And an internet connection — you&#x27;ll download perhaps 1 GB Docker images and other files.<p>Scala&#x2F;JVM - a bit too heavy for something simple as this. The system requirements are ridiculous. Why not implement similar things in Go? Gitea vs GitLab performance and ease of deploy is the best showcase for these tasks.",
      "time": 1585362967
    },
    {
      "deleted": true,
      "id": 22702601,
      "time": 1585315314
    },
    {
      "by": "shalabhc",
      "id": 22707227,
      "kids": [
        {
          "by": "vthriller",
          "id": 22707403,
          "kids": [
            {
              "by": "KajMagnus",
              "id": 22737736,
              "kids": [
                {
                  "by": "vthriller",
                  "id": 22741386,
                  "kids": [
                    {
                      "by": "KajMagnus",
                      "id": 22756354,
                      "kids": [
                        {
                          "by": "vthriller",
                          "id": 22770691,
                          "kids": [
                            {
                              "by": "KajMagnus",
                              "id": 22784792,
                              "text": "&gt;&gt; A button &quot;Show ansectors&quot;<p>&gt; That implementations seems to be both the most robust and the easiest to implement<p>I think so too. I&#x27;d like to implement it.<p>If you want to, you could send me an email (see my profile)? Then I can send you an email, once I&#x27;ve built this ( &gt;= 2 weeks), if you&#x27;d like to see how it works &amp; maybe have feedback<p>\\* * *<p>&gt; arrow-key navigation and highlight current message in some way<p>I&#x27;ve thought about that some times. Could also be nice for people with accessibilyty problems? (e.g. shaky hands, keyboard navigation better than the mouse pointer)<p>If the screen is small, e.g. on mobile, Talkyard could probably be pretty certain which post one is currently reading, so might work ok well, automatically.<p>&gt; not sure if that would work well outside of some special keyboard-centric navigation mode<p>Yes, maybe this would be for power users and people with disabilities.<p>&gt; but others would just switch to simpler software, with flatter conversations and&#x2F;or less navigation features<p>I suppose such power user navigation things, should be disabled by default.<p>\\* * *<p>&gt; sticky header at the top of the viewport?<p>Yes<p>&gt; going to be as problematic as keyboard shortcuts (i.e. can&#x27;t decide which message&#x27;s parent we need to jump and where to return to).<p>This is also related to highlighting the post one is reading — there&#x27;d be one specific parent post to jump to, when pressing &#x27;P&#x27;(arten).<p>Could also <i>experiment with</i> mouse pointing on a post, to make it the keyboard target. And then pressing &#x27;P&#x27; to jump to its parent.<p>\\* * *<p>&gt; Zulip comes to mind: in there selected message affects what topic people are going to reply into [ ...] result in misdirected replies<p>Now I&#x27;m wondering if this is a reason why e.g. Mattermost is more popular than Zulip.<p>Maybe it&#x27;s not only that Mattermost is better at marketing (are they?) but also that they are <i>less</i> &quot;power user focused&quot;?",
                              "time": 1586080554
                            }
                          ],
                          "text": "&gt; 2. What about keyboard shortcuts?<p>That just would not work on smartphones.<p>&gt; But how would Talkyard know which post, of many, you&#x27;re reading, if the screen is large<p>One way is to implement arrow-key navigation and highlight current message in some way (border, bgcolor or whatever), but I&#x27;m not sure if that would work well outside of some special keyboard-centric navigation mode designed to cater to fans of software like mutt or vimperator.<p>Zulip comes to mind: in there selected message affects what topic people are going to reply into, and if people are not used to that feature (or to the idea of chats with topics in general), they can easily dismiss or fail to notice that very selection and treat the input box just like they would that in any other chat app, which would result in misdirected replies. Some teams are fine with spending some time babysitting the conversation (change topics of other people&#x27;s replies after the fact, teach colleagues how to use that particular software etc.), but others would just switch to simpler software, with flatter conversations and&#x2F;or less navigation features.<p>&gt; 1. What if, at the top of the page, there were buttons like &quot;Scroll to parent&quot;?<p>Do you talk about the very top of the whole page (scroll position 0) or about sticky header at the top of the viewport? If it&#x27;s the latter, then it&#x27;s going to be as problematic as keyboard shortcuts (i.e. can&#x27;t decide which message&#x27;s parent we need to jump and where to return to).<p>&gt; 3. A button &quot;Show ansectors&quot;, for every post. Click it, and Talkyard would popup a dialog, with all ancestors (parent, grandparent, ...)<p>That implementations seems to be both the most robust and the easiest to implement.",
                          "time": 1585930077
                        }
                      ],
                      "text": "&gt; remind yourself about the context of the conversation\n&gt; Let met illustrate [...]<p>Thanks for showing &#x2F; clarifying. I have the precise same problem (here at HN mostly).<p>&gt; &quot;show me every parent message prior to this one&quot;<p>&gt; Sibling folding is just one of the ways to implement that.<p>3 ideas:<p>1. What if, at the top of the page, there were buttons like &quot;Scroll to parent&quot;? So that when you look up, to see if you can see the parent post there somewhere, then, instead you see a &quot;Scroll to parent&quot; button.  — Once one has scrolled to the parent, maybe to the grandparent, there&#x27;s a Back button to scroll back down and continue reading.<p>2. What about keyboard shortcuts?  If you click &#x27;P&#x27;, the page could scroll to the Parent. &#x27;P&#x27; once more, scrolls to the grandparent. &#x27;B&#x27; scrolls back down to the parent, &#x27;B&#x27; again scrolls back so you can continue reading.  (But how would Talkyard know which post, of many, you&#x27;re reading, if the screen is large? How know which parent, of many possible, you have in mind? Maybe there could be one Scroll to Parent button per indentation depth)<p>3. A button &quot;Show ansectors&quot;, for every post. Click it, and Talkyard would popup a dialog, with all ancestors (parent, grandparent, ...) and you could scroll up-up-up inside the dialog and have a look, and close it, once you&#x27;re done reading — without affecting your scroll position on the &quot;real&quot; page.",
                      "time": 1585803757
                    }
                  ],
                  "text": "I think &quot;show me every parent message prior to this one&quot; would be a better way to describe the feature that I occasionally miss in every implementation of threaded conversations. Sibling folding is just one of the ways to implement that.<p>The problem is that in very large threads it&#x27;s quite hard to remind yourself about the context of the conversation that you&#x27;re currently reading: you either need to scroll a lot to get to some grand-grandparent and back, or start manually folding messages above, one by one, subthread by subthread, until the context gets uncluttered.<p>Let met illustrate what I was describing: <a href=\"https:&#x2F;&#x2F;i.imgur.com&#x2F;pm1SIRJ.png?r\" rel=\"nofollow\">https:&#x2F;&#x2F;i.imgur.com&#x2F;pm1SIRJ.png?r</a> (You could imagine way more replies in those shaded areas—a situation that is not that uncommon here on HN.)",
                  "time": 1585682474
                }
              ],
              "text": "&gt; too much padding<p>I&#x27;ve been thinking about that — after all, Reddit with its concise design, is pretty nice.<p>I&#x27;d want there to be an optional concise theme, so Talkyard could look more like HN or Reddit, for those who prefer that.<p>&gt; fold all sibling messages before the one that I&#x27;m interested in<p>Where could be a good place to place a Fold-all-siblings button? There is a Fold-whole-thread button already at the top of each post, to the right of the author name (it looks like:  ^ and to un-fold:  v  ),  ...<p>... but if one has scrolled down a bit, and want to fold all siblings, when the parent post is a bit away, then, could be impractical to have to scroll up to it, and click a button up there?<p>Maybe clicking the arrow could open a power user menu, with &quot;Scroll to parent&quot; as the default, and also a &quot;Collapse siblings&quot; button?<p>Example: If you go here: <a href=\"https:&#x2F;&#x2F;insightful.demo.talkyard.io&#x2F;-9#post-24\" rel=\"nofollow\">https:&#x2F;&#x2F;insightful.demo.talkyard.io&#x2F;-9#post-24</a> and click the arrow to the left, maybe this poweruser popup menu could open?<p>And &#x2F; or you have other ideas? :- )",
              "time": 1585664394
            }
          ],
          "text": "I&#x27;m not a fan of the style that threaded discussions have (too much padding, and I&#x27;m not sure about arrows too), but I always wanted to experiment with that sort of arrangement of messages, where long chain of one-on-one replies does not get pushed to the right but instead have some sort of linear representation. Will definitely have a closer look on that software.<p>Edit: what this implementation of threads lacks though is an ability to fold all sibling messages before the one that I&#x27;m interested in, so that I can have a quick look at the context and avoid a lot of manual scrolling and folding myself. Most implementations (like here on HN for instance) only do folding of child messages, which I personally find a bit less useful.",
          "time": 1585347338
        }
      ],
      "text": "I&#x27;ve been using the hosted version of this (<a href=\"https:&#x2F;&#x2F;www.talkyard.io\" rel=\"nofollow\">https:&#x2F;&#x2F;www.talkyard.io</a>) on a blog for a while and have been very satisfied. I like how the threaded discussion looks, and also like the live preview edit box which works well for long form comments.",
      "time": 1585345838
    },
    {
      "by": "jimkleiber",
      "id": 22707779,
      "kids": [
        {
          "by": "nerdbaggy",
          "id": 22707886,
          "kids": [
            {
              "by": "jimkleiber",
              "id": 22733154,
              "kids": [
                {
                  "by": "KajMagnus",
                  "id": 22737339,
                  "text": "@jimkleiber, Discourse, and Talkyard too, also have settings for Require-manual-approval-of-new-users. And restricting signups to whitelisted email domains.<p>How will &#x2F; do-you-have-in-mind-to verify people&#x27;s identities?<p>Talkyard (like Discourse) has Single Sign-On via API — so you can have an external piece of software that somehow verifies people&#x27;s identities, and Single Sign-On connects to Talkyard and upserts those verified users  (like @nerdbaggy wrote).<p>With Talkyard, the SSO API looks like this: Your own piece of software sends `POST talkyard-server&#x2F;-&#x2F;v0&#x2F;sso-upsert-user-generate-login-secret` plus JSON for an external user. Then you get back a login secret, and you can redirect the end user&#x27;s browser to `talkyard-server&#x2F;-&#x2F;v0&#x2F;login-with-secret?oneTimeSecret=...`<p>\\* * *<p>@jimkleiber you asked @nerdbaggy:<p>&gt; not sure which service you use to do the identity verification. Could you say a little more about how you did it?<p>I&#x27;m thinking @nerdbaggy meant s&#x2F;he Single Sign-On integrated with Discourse? But maybe didn&#x27;t actually verify people&#x27;s identities. Those are two different things, and I&#x27;m thinking likely you&#x27;ll need to come up with your own way to verify people&#x27;s identities (?)",
                  "time": 1585661529
                }
              ],
              "text": "Nice, I see the link talks about SSO with Discourse but not sure which service you use to do the identity verification. Could you say a little more about how you did it?",
              "time": 1585610233
            }
          ],
          "text": "If you can write some code discourse can do it. I’ve done it and it’s easy <a href=\"https:&#x2F;&#x2F;meta.discourse.org&#x2F;t&#x2F;official-single-sign-on-for-discourse-sso&#x2F;13045\" rel=\"nofollow\">https:&#x2F;&#x2F;meta.discourse.org&#x2F;t&#x2F;official-single-sign-on-for-dis...</a>",
          "time": 1585352361
        }
      ],
      "text": "I&#x27;ve been looking for a forum software that would let me have verified identities for my users, either restrict the forum only to verified users or even let users optionally verify themselves, and I haven&#x27;t found one yet.<p>Have you considered adding a feature like this?",
      "time": 1585351253
    },
    {
      "by": "marqpdx",
      "id": 22711469,
      "kids": [
        {
          "by": "KajMagnus",
          "id": 22714435,
          "kids": [
            {
              "by": "marqpdx",
              "id": 22749858,
              "kids": [
                {
                  "by": "KajMagnus",
                  "id": 22775332,
                  "text": "&gt; list out some of the easier tasks that you have on your to-do list<p>I think that&#x27;s a good idea. Maybe the next steps for finding contributors, isn&#x27;t to find a place on the Internet where many want-to-be-contibutor-to-something hangs out, but instead have better docs and to-do lists for those who find their way to Talkyard already somehow.<p>&gt; bringing in other devs is a huge step<p>I think the first contribution tasks would be to just find out where they get stuck, when they try to get something done. And then I&#x27;ll remove such &quot;roadblocks&quot; one at a time, until people can actually get things done.  — Maybe this  means many small steps :- )",
                  "time": 1585961904
                }
              ],
              "text": "Would it be possible for you to list out some of the easier tasks that you have on your to-do list, and solicit coders to work on those. i know that bringing in other devs is a huge step, but you&#x27;ve put together a very solid platform, and it&#x27;d be great to see it keep growing.",
              "time": 1585755852
            }
          ],
          "text": "Thanks :- )<p>&gt; bringing on other developers, opening up to other contributors?<p>Yes that&#x27;s the plan, definitely<p>This far, some people have contributed translations. I think right now it&#x27;s a bit complicated to get started with writing source code and running tests, and there are some refactorings and renames I started but didn&#x27;t finish yet, making the source code directory structure a bit confusing.<p>(If you have ideas about how &#x2F; where to find people who might want to try to contribute, it&#x27;d be interesting to hear)",
          "time": 1585430697
        }
      ],
      "text": "Have been running Talkyard as a sandbox for a month and it&#x27;s great.<p>Will you be bringing on other developers, opening up to other contributors? My only worry is the dependence on just you KajMagnus. Amazing job so far!!",
      "time": 1585407201
    },
    {
      "by": "akvadrako",
      "id": 22704726,
      "kids": [
        {
          "by": "KajMagnus",
          "id": 22706799,
          "kids": [
            {
              "by": "structural",
              "id": 22713987,
              "kids": [
                {
                  "by": "KajMagnus",
                  "id": 22725507,
                  "text": "Thanks for the feedback! I&#x27;ve never edited a wiki as a member of a large organization.<p>Talkyard does the things you mentioned, although it&#x27;s not so discoverable:  Most people don&#x27;t think about clicking their way to the Category | Security settings, and looking at the checkboxes, and thinking about how to combine them to create a Wiki.<p>Maybe Wiki features could be listed on the homepage, or at least in a feature matrix. And, when creating a new forum topics category, one could get a question about if it&#x27;s going to be a Wiki topics category.<p>* * *<p>There&#x27;s one Wiki feature that Talkyard lacks though: Easy linking between different pages. At Wikipedia, for example, one types:  &#x27;[[Target page name#Target section|Link text]]&#x27; — there&#x27;s nothing like that in Talkyard.<p>A wiki main page shortcut link somewhere would be nice too (e.g. in the left hand sidebar).<p>(I&#x27;m curious about if you use wikis where you are now, which Wiki software, and how do you like it?)",
                  "time": 1585546378
                }
              ],
              "text": "Two important aspects of being a wiki replacement, especially at a larger scale:<p>- Group ownership of particular topics or sections of topics. This allows for things like &quot;anyone on the team responsible for project X can edit&#x2F;moderate things regarding their project&quot;<p>- History of edits made to topics, linked to author. It&#x27;s incredibly valuable organizationally to be able to see the evolution of knowledge, as well as provides protection from content deletion, both accidental and malicious.",
              "time": 1585426390
            }
          ],
          "text": "It can work as a wiki, if one edits the per category security settings, which look like so:<p><pre><code>    These people: [All Members  v]\n    may do this:\n\n      :\n      [ ] Edit other people&#x27;s topics\n      [ ] Edit others&#x27; comments\n      [x] Edit one&#x27;s own stuff\n      [ ] Delete others&#x27; topics\n      :\n      :\n</code></pre>\nThis: ` [All Members  v] ` is a choose-group dropdown. There&#x27;re custom groups and trust level groups, e.g. Full Members and Trusted Members.",
          "time": 1585342535
        }
      ],
      "text": "If only it was also a wiki.",
      "time": 1585329264
    },
    {
      "by": "yamrzou",
      "id": 22705106,
      "kids": [
        {
          "by": "KajMagnus",
          "id": 22706683,
          "kids": [
            {
              "by": "yamrzou",
              "id": 22710033,
              "kids": [
                {
                  "by": "KajMagnus",
                  "id": 22725696,
                  "text": "&gt; I lose track of the which comment corresponds to which parent<p>Me too, here at HN.  When I&#x27;m reading on my phone, looking at reply R to a parent post P somewhere far above, and I want to re-read P — then I place my finger to the left on the screen, at the current indentation depth, and scroll up up up, past the even-more-indented-replies above ... until the indentation depth becomes 1 step less than my finger. Then I&#x27;ve found the parent comment :- )<p>Problem is, how do I find the reply R again. And, sometimes I accidentally move my finger, losing track of both R and P.<p>In Talkyard, one can instead click the arrows to jump to the parent, and the Back to jump back to the reply R — here&#x27;s a demo about that: <a href=\"https:&#x2F;&#x2F;www.talkyard.io&#x2F;-32&#x2F;how-hacker-news-can-be-improved-3-things\" rel=\"nofollow\">https:&#x2F;&#x2F;www.talkyard.io&#x2F;-32&#x2F;how-hacker-news-can-be-improved-...</a><p>If you want to try this yourself, go here: <a href=\"https:&#x2F;&#x2F;www.talkyard.io&#x2F;-71#post-16\" rel=\"nofollow\">https:&#x2F;&#x2F;www.talkyard.io&#x2F;-71#post-16</a>  then click the long arrow to the left, then click Back at the bottom of the screen.<p>&gt; unfold level 1 replies for the first comment, while keeping level 2 hidden<p>Something like that, yes. At the same time, since popular &#x2F; &quot;good&quot; replies are sorted first, I think it can make sense to unfold a few of the level 2 replies, for the topmost level 1 replies — so one needs to click fewer times, to read the &quot;most interesting&quot; things. But these are minor details; I agree with the overall idea.<p>&gt; Rather for myself, but as an account setting<p>Ok. There&#x27;re also custom user groups — so a site admin could configure this setting for the Everyone group, and then one could override it, individually.<p>\\* * *<p>&gt;&gt; what things lag the most<p>&gt; Mostly animations [...]<p>Ok, thanks for the detailed feedback. I think the code is doing things too much sequentially — like, first loading any draft — an X * 100 ms round trip to the server. Then scrolling the post one replies to into view, Y * 100 ms, then scrolling the preview into view, Z * 100 ms (so both are visible at the same time, if possible).  — If instead everything happened at once, it&#x27;d seem more instant.<p>(Also, there&#x27;re editor Javascript:s that JIT-compiles and runs the first time one opens the editor.)",
                  "time": 1585549445
                }
              ],
              "text": "&gt; Yes :- ) Do you mean 1) for yourself only, or 2) for all site visitors (so those replies would be collapsed by default, for everyone) ?<p>Rather for myself, but as an account setting so that I don&#x27;t have to collapse them manually for each thread. Actually it stems from something that bothers me with HN: when there are a lot of nested replies, I lose track of the which comment corresponds to which parent. For example, try reading this thread : <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=22705222\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=22705222</a>, I find it difficult.<p>If there are 5 comments (level 0), that each has 10 replies (level 1) and each one of them has 10 replies (level 2), I wish I was able to collapse level n&gt;0 replies to read the comments first, then be able to unfold level 1 replies for the first comment, while keeping level 2 hidden, and so on. \nThis might not be the ideal solution, maybe simply the way you added arrows to replies would make the above thread easier to read.<p>&gt; What things lag the most? (Some specific button(s) or animation or scrolling or ... ?)<p>I just found it&#x27;s not specific to android (I&#x27;m using Android 10 on a recent galaxy smartphone). Mostly animations. On the desktop version, If I click on the plus button near &#x27;Chat Channels&#x27;, the login window is show progressively, and the background is dimmed in way that &#x27;feels&#x27; slow. Also when I unfold a collapsed reply, the page moves slowly (is there a reason it moves ?). \nWhen I click reply, a window is shown, &#x27;loading draft...&#x27; appears then disappears quickly and then the preview is highlighted, it somehow feels slow.",
              "time": 1585385987
            }
          ],
          "text": "There&#x27;s multilingual support yes, and user contributed out-of-date translations to Brazilian Portuguese, Russian and Polish<p>(I keep adding new buttons and labels, and renaming things, so the translations get out-of-date &#x2F; fallback to English.)<p>There&#x27;s RTL support but no Arabic &#x2F; Hebrew &#x2F; etc translations yet.<p>* * *<p>&gt; It would be nice to have a button to collapse replies for a given comment, but not the comment itself<p>Yes :- ) Do you mean 1) for yourself only, or 2) for all site visitors (so those replies would be collapsed by default, for everyone) ?<p>Actually there was a feature for 2, in the past, but it&#x27;s disabled now though. The database fields are still there, plan to make that code work again some time in the future. (Then you could manually &quot;curate&quot; a discussion, by collapsing all replies to certain posts, to make the reading experience better for your site visitors.)<p>* * *<p>Can I ask which Android version and phone do you use? — I optimized Talkyard a while ago, by looking in Chrome Dev Tools, but this was on my laptop.<p>What things lag the most? (Some specific button(s) or animation or scrolling or ... ?)",
          "time": 1585341761
        }
      ],
      "text": "Looks great. Does it have multilingual support?<p>A few remarks:<p>- It would be nice to have a button to collapse replies for a given comment, but not the comment itself.<p>- On mobile (andoid), it is bit laggy.<p>Thank you for open-sourcing.",
      "time": 1585331783
    },
    {
      "by": "mavsman",
      "id": 22706248,
      "kids": [
        {
          "by": "KajMagnus",
          "id": 22706457,
          "text": "&gt; Have you worked on Discourse<p>No<p>&gt; because you like them?<p>Yes (the software,  ... and the company &amp; founders &amp; employees I like too, &amp; their visions)",
          "time": 1585340437
        }
      ],
      "text": "Have you worked on Discourse as well or just borrowing heavily from their styles because you like them?",
      "time": 1585339174
    },
    {
      "by": "sandGorgon",
      "id": 22704950,
      "kids": [
        {
          "by": "alharith",
          "id": 22704986,
          "kids": [
            {
              "by": "dceddia",
              "id": 22705108,
              "kids": [
                {
                  "by": "KajMagnus",
                  "id": 22707123,
                  "kids": [
                    {
                      "by": "alharith",
                      "id": 22711283,
                      "kids": [
                        {
                          "by": "KajMagnus",
                          "id": 22725450,
                          "text": "Same here :- )  Just a bit later, fall &#x2F; winter 2014.<p>Thanks for the link. I think I saw that page, or sth similar, back then. ... Now I found an old question I posted at StackOverflow about jQuery + React:\n<a href=\"https:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;27646347&#x2F;is-it-okay-to-do-all-these-jquery-things-to-a-react-js-dom-tree\" rel=\"nofollow\">https:&#x2F;&#x2F;stackoverflow.com&#x2F;questions&#x2F;27646347&#x2F;is-it-okay-to-d...</a>",
                          "time": 1585545402
                        }
                      ],
                      "text": "I was a very early adopter of React at my company (fall 2013) and IIRC,  using jQuery with React was still in the docs.<p>edit: and it still is today, just a tad updated: <a href=\"https:&#x2F;&#x2F;reactjs.org&#x2F;docs&#x2F;integrating-with-other-libraries.html\" rel=\"nofollow\">https:&#x2F;&#x2F;reactjs.org&#x2F;docs&#x2F;integrating-with-other-libraries.ht...</a>",
                      "time": 1585405322
                    }
                  ],
                  "text": "Now jQuery is gone (see my other reply just nearby, in this same comments tree).<p>Actually, when I was starting with React, then for a while Talkyard did use both jQuery and React on the same pages (not a good idea, I agree). I was careful to avoid the bugs you have in mind from happening, so that wasn&#x27;t a problem,<p>however, loading &amp; using both libs wasn&#x27;t good for performance — just parsing and executing the 30 kb min.js.gz jQuery bundle took maybe half a second? a second? on mobile phones, back at the time (2.5 years ago).",
                  "time": 1585344884
                }
              ],
              "text": "Using them on separate pages is fine, but using React and jQuery on the same page is usually not a good idea since React needs to “own” its slice of the DOM and changing things in there with jQuery could cause weird bugs.<p>But anyway, it’s impossible to tell from just the package.json file whether React and jQuery are being used on the same page, or just both used in different parts of the app.",
              "time": 1585331787
            },
            {
              "by": "KajMagnus",
              "id": 22707427,
              "kids": [
                {
                  "by": "sandGorgon",
                  "id": 22716599,
                  "kids": [
                    {
                      "by": "KajMagnus",
                      "id": 22725434,
                      "text": "Actually to me, Bliss not getting new features or changes (just maintenance by Lea Verou), is a good thing. Upgrading libs and breaking changes, takes time — stability is nice :- )<p>I agree that React is fast enough. React is pretty <i>large</i> though, takes a bit time to parse and compile the code, on mobile. And none of its features are needed in this case, and could instead cause conflicts with other libs.<p>What I&#x27;d do, if anything, is a custom build &#x2F; fork of Bliss that removes most of the code, so 3 kb becomes Bliss maybe just 1 kb &quot;Mini-Bliss&quot;.",
                      "time": 1585545129
                    }
                  ],
                  "text": "Last commit to bliss seems to be April (and then a few automatic package update commits)<p>I would seriously consider dropping this dependency. React&#x27;s performance is fairly acceptable.",
                  "time": 1585458543
                }
              ],
              "text": "Alpine.js looks nice, didn&#x27;t know about it. Light-weigth React&#x2F;Vue&#x2F;etc for just 7 kb :- )<p>I use Bliss.js, <a href=\"https:&#x2F;&#x2F;github.com&#x2F;LeaVerou&#x2F;bliss\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;LeaVerou&#x2F;bliss</a> for some parts of Talkyard nowadays, where React would be too much. Bliss.js is sth like 3 kb min.js.gz. (But jQuery itself is gone nowadays, it was too large.)",
              "time": 1585347513
            },
            {
              "by": "sandGorgon",
              "id": 22705469,
              "kids": [
                {
                  "by": "KajMagnus",
                  "id": 22707134,
                  "text": "And performance, see my other comments nearby (jQuery now gone).",
                  "time": 1585344989
                }
              ],
              "text": "the problem is that react and jquery both need ownership of the DOM. if you have code that mixes them, it is recipe for disaster. \nsubtle hidden bugs start creeping up.",
              "time": 1585334037
            }
          ],
          "text": "What? Is this really controversial? Sometimes you need a UI library, sometimes you need really quick interactivity to toggle a menu. I use alpine.js on my marketing pages, and I use vue&#x2F;svelte within sections of my app.",
          "time": 1585330966
        },
        {
          "by": "castis",
          "id": 22706197,
          "kids": [
            {
              "by": "KajMagnus",
              "id": 22707060,
              "text": "It doesn&#x27;t use or load jQuery any longer,<p>however the dependency was still there ... Now I&#x27;m removing it.<p>In the beginning, there was only jQuery. .... Then, for a while, there was also Angular, and for a short while, a tiny bit Angular Dart (I got on the hype train?).<p>Then, there was a month removing all Angular things, and switching to React. And then ... Another month removing all jQuery things.<p>There&#x27;s still a disabled way of laying out a discussion in 2D, using the full width of the screen (nice with a 30&#x27;&#x27; monitor :- )) and then, for horizontal scrolling, jQuery was used. But all this 2D stuff is disabled nowadays (I like the 2D layout but it&#x27;s a rarely used power user feature and I was too short of time so had to disable it).<p>(The reason I removed jQuery, and use React only, was to improve performance — just parsing and executing the 30 kb min.js.gz jQuery bundle took maybe half a second? on mobile phones.)",
              "time": 1585344449
            }
          ],
          "text": "My blind guess is; one hand not know what the other is doing.<p>Ive left projects and come back to find the developer between had done things like, pull in a library to handle slideshows when one already existed. Things like that.",
          "time": 1585338786
        }
      ],
      "text": "why does the code use reactjs AND jquery ? <a href=\"https:&#x2F;&#x2F;github.com&#x2F;debiki&#x2F;talkyard&#x2F;blob&#x2F;master&#x2F;package.json\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;debiki&#x2F;talkyard&#x2F;blob&#x2F;master&#x2F;package.json</a>",
      "time": 1585330726
    }
  ],
  "score": 248,
  "time": 1585312186,
  "title": "Talkyard: Open-Source forum software – a StackOverflow, Reddit, Disqus hybrid",
  "url": "https://github.com/debiki/talkyard"
}