{"by": "beedrillzzzzz", "descendants": 329, "id": 22506722, "kids": [{"by": "kmod", "id": 22507135, "kids": [{"by": "Taek", "id": 22507281, "kids": [{"by": "kmod", "id": 22507617, "kids": [{"by": "Taek", "id": 22507972, "kids": [{"by": "jstummbillig", "id": 22511558, "kids": [{"by": "Ajedi32", "id": 22516433, "text": "The fact that nobody is able to prove it&#x27;s a bad idea doesn&#x27;t necessarily mean it&#x27;s a good one. There might still be other downsides that haven&#x27;t been considered, some of which could be solveable with more development work and some not.<p>At this point the cautious skeptic will be thinking &quot;hmm, maybe there&#x27;s something to this&quot;, not necessarily full on rejoicing.<p>That said, I agree it does seem promising. If you ever find yourself in need of cheap cloud storage it wouldn&#x27;t hurt to look into Sia as a possible option.", "time": 1583643765}, {"by": "zzzcpan", "id": 22511651, "text": "No, the author&#x27;s idea is ok and he&#x27;s mostly right on the cost part. Configuration and the numbers are a bit off and unrealistic, you won&#x27;t get such low 95% availability per site due to other economical and technological constraints, you&#x27;ll get at least 99%, but probably closer to three nines per site and 64 out of 96 won&#x27;t be necessary at all (something like 8 out of 12 could be enough). Dropbox designer is just ignorant, biased and conditioned to US market and environment, but appeals to authority, so people upvote his bad comment. I do storage too, on smaller scale than Dropbox of course, not in the US, but it is distributed and the cost is already lower than what you see in the title.", "time": 1583591347}, {"by": "fragmede", "id": 22513137, "kids": [{"by": "tuananh", "id": 22523819, "text": "no. the author mentions &quot;64-of-96&quot; things in the post as well. I don&#x27;t think kmod means to do what you said.", "time": 1583741933}], "text": "Dropbox designer name dropped &quot;64-of-96 RS encoding&quot; as if they&#x27;re the only person that&#x27;s heard of, or dealt with Reed-solomon encoding before, and expected the author to get scared off. There is, in the case of drop box, <i>plenty</i> of ground to crush Sia into. That is the ground between the 95% and multiple-nines of availability.<p>Engineering is about tradeoffs. I could build a network as good as Google&#x27;s with infinite money, infinite time, and infinite help. I could design a product as beautify as Apple&#x27;s with the same lack of limitations. Unfortunately for me, I have limited money, limited time, and limited help. Every systems designer understands that, innately, so isn&#x27;t rushing out of the woodword because Sia and Dropbox have merely chosen different tradeoffs. That one has IPO&#x27;d is uninteresting in the abstract. It&#x27;s just money after all.", "time": 1583605938}], "text": "So, is this it? Dropbox designer challenges the project broadly, gets top comment, Author refutes – and we leave it at that?<p>I mean this is basically the moment where I would expect every systems designer on HN coming out of the woods and crushing Sia into the ground, if there were, in fact, any ground at all to crush Sia into.<p>Is this actually legit? If so, where is the rejoicing? What am I missing?", "time": 1583589641}, {"by": "Legogris", "id": 22508084, "kids": [{"by": "H8crilA", "id": 22509525, "kids": [{"by": "Legogris", "id": 22524392, "text": "12.5% is far from the total overhead, just an additional compounding factor.", "time": 1583751570}], "text": "12.5% overhead isn&#x27;t that much. It&#x27;s what just the networking gear can easily eat in a data center (12% out of all the non-cooling-related power supply).<p>Reed-Solomon encoding adds 50%, of you want 3 block per 2 data blocks. Replicated encoding (not relevant here since this is allow throughput usecase, but necessary if you want to sustain high read throughput) is adding at least 200% (if you want a 3x replication, which I think should be the minimum).", "time": 1583551461}, {"by": "monocasa", "id": 22508181, "kids": [{"by": "rasz", "id": 22509817, "kids": [{"by": "ec109685", "id": 22512769, "kids": [{"by": "majdnemkocka", "id": 22514579, "kids": [{"by": "ec109685", "id": 22516313, "text": "Oops. Thanks.", "time": 1583640967}], "text": "They are not, see the link in the article: <a href=\"https:&#x2F;&#x2F;www.amazon.com&#x2F;HGST-7-2K-SATA-Drive-Model&#x2F;dp&#x2F;B07XQRBJGZ&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.amazon.com&#x2F;HGST-7-2K-SATA-Drive-Model&#x2F;dp&#x2F;B07XQRB...</a>", "time": 1583619279}], "text": "These are ssd’s.", "time": 1583602198}], "text": "Spinning iron doesnt like start&#x2F;stop cycles. Server drives go thru very few in their entire life for that very reason.", "time": 1583556827}], "text": "Turn &#x27;em off if they&#x27;re not contributing.", "time": 1583535723}, {"by": "dahfizz", "id": 22511604, "text": "87.5% efficient is not incredibly inefficient.", "time": 1583590477}, {"deleted": true, "id": 22509590, "time": 1583552471}, {"by": "manigandham", "id": 22510072, "text": "Compared to what though? How efficient is a typical data center? Probably way less than this.", "time": 1583561053}], "text": "That sounds incredibly energy-inefficient. On average you have 12.5% of servers running but not contributing and possibly incurring load on other nodes.", "time": 1583534783}], "text": "Sure! First up, we don&#x27;t do repairs every time one host goes down. Standard practice on the network is to wait to do a repair until a full 25% of the redundancy is missing (in 64-of-96, that would be 8 hosts offline). Then you repair all 8 at once, significantly reducing the total amount of repair traffic.<p>But secondly, offline doesn&#x27;t usually mean dead and gone, with unstable datacenters like this they are usually back online before the user has lost a full 25% of their redundancy.<p>Row level and rack level outages are handled by data randomization. The entire Sia system heavily depends on probabilistic techniques, both on the renting and hosting side. Row level failures will take out some of your data, but nobody should be disproportionately impacted by a cluster failure.<p>On Sia, each piece is at a different site. So 64-of-96 implies that each chunk of data (96 pieces to a chunk) is located in 96 different places. This doesn&#x27;t help with the geo-bandwidth, but as discussed above there are other techniques to handle that.<p>Surprisingly, bandwidth pricing on the Sia network is even cheaper than storage pricing relative to centralized competition. That&#x27;s a lot harder to model at scale though, so we aren&#x27;t as confident the Sia bandwidth pricing will hold up at $1 &#x2F; TB in the long term.<p>And technically, most of this stuff is customizable per-customer. If your particular use case has a different optimal parameterization, it&#x27;s fairly easy to tune your client to suit your particular needs.", "time": 1583533987}, {"by": "DuskStar", "id": 22507913, "kids": [{"by": "Taek", "id": 22508014, "kids": [{"by": "DuskStar", "id": 22508327, "text": "Gotcha, and your reply to the GP clarified a lot for me!", "time": 1583536950}], "text": "Definitely not, aggregate uptime is extremely high. We&#x27;ve never seen downtime do to network outages, only software bugs. And even then, only some users were impacted by the bugs, we&#x27;ve never in 5 years had a broad outage.", "time": 1583534261}], "text": "I think his point is that he&#x27;s targeting low <i>aggregate</i> uptime, too.", "time": 1583533438}], "text": "Sure, let&#x27;s dig into networking. Who pays for rereplication traffic? If you do 64-of-96 RS encoding, that means for every failure you need to transfer 64x the lost storage capacity. If you&#x27;re targeting a &quot;low individual uptime but high aggregate uptime&quot; model this means you need to be storing data in multiple sites -- and dedicated cross-geo bandwidth is expensive. I agree that in the happy case you can use low-bandwidth cheap equipment, but to get good reliability you need to provision for larger clustered failures such as rack- and row-level outages.", "time": 1583531058}, {"by": "arcticbull", "id": 22507511, "kids": [{"by": "Dylan16807", "id": 22508989, "kids": [{"by": "manigandham", "id": 22510084, "kids": [{"by": "Dylan16807", "id": 22510119, "kids": [{"by": "manigandham", "id": 22510552, "text": "S3 Standard and S3 IA store multiple copies spread across 3 zones. S3 One-Zone IA is stored as multiple copies but all within a single zone. They give you the same technical durability but less availability if that zone goes down, and if it&#x27;s destroyed then you lose all your data.", "time": 1583569654}], "text": "Infrequent Access is closer.  But wow, one-zone sure is only 20% cheaper than three-zone.  And the retrieval cost is significantly more expensive than glacier&#x27;s bulk price.<p>Actually, looking closer, is one-zone even storing fewer copies?  It&#x27;s offering the same durability, <i>except</i> in the case of &quot;availability zone destruction&quot;.  So if they&#x27;re selling three copies for $10 a TB, then the equivalent price for 64-of-96 would be $5 a TB.  Cutting that down with cheaper worse hardware would go a long way to get you toward the $2 goal.", "time": 1583562039}], "text": "S3 Reduced Redundancy is replaced with S3 Infrequent Access (and another lower tier One-Zone Infrequent Access) so there&#x27;s still some pricing flexibility available.", "time": 1583561222}, {"by": "hinkley", "id": 22515259, "text": "That has the potential to cut both ways.  If Amazon decides that S3 is their loss leader, then they would absolutely bury boutique players who only cover a few functional areas.<p>If instead they decide it&#x27;s the cash cow, then it wouldn&#x27;t be a stretch to predict that they price it a bit above the competition. The customer has the impression that they can amortize the cost across the other value-adds in the ecosystem. Whether the customer is right or not barely matters to Amazon from a purely financial aspect. All that matters is that they believe it to be true.<p>There&#x27;s also the short-term versus the long term strategy.  Short term they could do either and I wouldn&#x27;t be surprised. Long term, I think I would expect the latter.", "time": 1583627010}, {"by": "NohatCoder", "id": 22512325, "kids": [{"by": "Dylan16807", "id": 22513045, "text": "<a href=\"https:&#x2F;&#x2F;aws.amazon.com&#x2F;s3&#x2F;pricing&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;aws.amazon.com&#x2F;s3&#x2F;pricing&#x2F;</a><p>Glacier Deep Archive is .99&#x2F;TB&#x2F;month in US East and EU Ireland and several others, plus $2.50&#x2F;TB bulk retrieval.<p><a href=\"https:&#x2F;&#x2F;cloud.google.com&#x2F;storage&#x2F;pricing\" rel=\"nofollow\">https:&#x2F;&#x2F;cloud.google.com&#x2F;storage&#x2F;pricing</a><p>Archive Storage is $1.20&#x2F;TB&#x2F;month in us-east1 and europe-west1 and several others.  But (instant) retrieval is $50&#x2F;TB, with no options...", "time": 1583605057}], "text": "Where did you get those prices? I can&#x27;t find anything cheaper than $4 per TB month at both Google and Amazon.", "time": 1583598069}], "text": "&gt; If there was a demand for sorta-reliable, they&#x27;d build a sorta-reliable S3 and undercut you.<p>Amazon&#x27;s goal is to get people to pay a premium to get access to their entire ecosystem of services.  They don&#x27;t optimize the price of each individual service.  There&#x27;s a lot of take it or leave it for their specific offerings.  Look at how they used to have reduced redundancy as a cost saver, but don&#x27;t anymore.  If you want corner-cutting storage from Amazon, you get funneled into Glacier now.<p>So let&#x27;s look at how glacier deep archive is $.99 per TB per month, with a waiting time.  And Google&#x27;s weird offering where it costs $1.23 per TB per month, with instant access, but you pay a bunch of money to access.  That means they can&#x27;t store it on tapes, but they expect to profit anyway.  And they&#x27;re probably not running that as a loss leader that depends on the archival data being accessed.", "time": 1583543673}, {"by": "throwaway9878", "id": 22507601, "kids": [{"by": "enaaem", "id": 22508538, "kids": [{"by": "nojvek", "id": 22513572, "kids": [{"by": "enaaem", "id": 22517533, "text": "It&#x27;s true that benefits for customers would likely be only temporary. But that is not my main point.<p>I&#x27;m explaining a common business move called pay to play, in industries that require very high investments for new competitors. If customers want B to compete, they have to pay B first to ensure B does not make a loss, so everyone wins a little in the end.<p>So in the case of OP. He needs to finds paying customers first, who are willing to pre-order his service.", "time": 1583667328}], "text": "Not really. Suppose giant A undercuts startup B where A is making a temporary loss but B runs out of money trying to complete, only A remains in the market and A starts charging a premium since it doesn’t have completion.<p>This is bad for customers in the long term. Like how Amazon is slowly destroying brick and mortar stores, or having Amazon Basics at the front undercutting other sellers. Monopolies mean you don’t have an open fair market anymore.", "time": 1583610212}], "text": "Very good point! Let&#x27;s say you move into a new market, trying to undercut the status quo. The status quo, with their power of scale and experience can just undercut you back. Who is benefitting from this? The customers! So if the customers want more competition they have to pay you to play. Which means they have to co-invest with you and promise to buy your service later.<p>A good is example are the Apple iPhone screens. If Apple wants a new competing supplier, they have to invest in new competitors.", "time": 1583539054}, {"by": "nemonemo", "id": 22507659, "kids": [{"by": "jessriedel", "id": 22507768, "kids": [{"by": "res0nat0r", "id": 22508213, "kids": [{"by": "paulryanrogers", "id": 22508351, "kids": [{"by": "notyourday", "id": 22509075, "kids": [{"by": "Dylan16807", "id": 22510208, "kids": [{"by": "notyourday", "id": 22511180, "text": "Yeah, I have been proxy accessing my personal S3 that way, but I&#x27;m not really willing to bet a business on it.", "time": 1583582690}], "text": "It&#x27;s... interesting... that Amazon offers reasonably priced bandwidth on Lightsail, but it&#x27;s against the TOS to use it in connection with other services.", "time": 1583563625}], "text": "Nope. That&#x27;s what actually kills you on Amazon - network costs.", "time": 1583544613}], "text": "Did that include network IO to retrieve your data?", "time": 1583537170}, {"by": "zadokshi", "id": 22514102, "kids": [{"by": "Dylan16807", "id": 22515713, "text": "Putting it into normal S3 only costs $2.50 a TB.  That&#x27;s very affordable.<p>To get out of Amazon entirely, they definitely want to gouge you, but it&#x27;s not the end of the world.  If $24 a year is an acceptable storage price, then Snowball export costing somewhere around $36&#x2F;TB in bulk isn&#x27;t too awful.  (And if you don&#x27;t have enough data to fill up a snowball, you can probably smuggle it out through lightsail.)", "time": 1583632022}], "text": "Not really. Have you ever done the maths on what it costs to recover 1TB in a recovery situation.<p>Definitely not worth it.", "time": 1583615539}], "text": "It should also be noted that you can get S3 storage for $1&#x2F;TB&#x2F;month already if you use the Glacier Deep Archive storage class.", "time": 1583535958}], "text": "It&#x27;s possible that there could be non-obvious innovations in how to save money with a low reliability threshold, which Amazon might not be able to effortlessly copy.", "time": 1583532298}], "text": "I think the point is that the cost should not be the main motivator. I would agree that there needs to be other differentiators in addition to cost, which could provide sufficient moat against other competitors, big or small.", "time": 1583531377}, {"by": "arcticbull", "id": 22507718, "kids": [{"by": "badestrand", "id": 22509498, "text": "You are confusing &quot;cheapest option possible&quot; with &quot;cheapest option available&quot;. Maybe Amazon _could_ be cheapest and most efficient in everything but they aren&#x27;t, that&#x27;s why they make a lot of profit with their cloud services. Thus there can easily be a competitor with a cheaper offering, especially if they are cutting some corners as per the article, even if they have some inefficiencies in other areas.", "time": 1583550949}], "text": "My point is taking something, adding inefficiency, then pronouncing it&#x27;s &quot;cheapest in class&quot; isn&#x27;t logically possible.", "time": 1583531868}, {"by": "paxys", "id": 22507915, "kids": [{"by": "wju3h3uwh", "id": 22508526, "text": "Quantity is a type of quality. Lots of people mainly use cloud storage as a cold storage locker for backing up photos and documents. I&#x27;m sure there&#x27;s ways to innovate in the space that would make certain clouds more appealing, but most solutions are already effective as simple storage lockers. Doing it better instead of cheaper at this point is more likely to be either a megacorp affiliation perk, like a discount on a YouTube Music subscription, or phone company style family plan discounts &quot;Get discounted storage for the whole family if you pay slightly less than the price of four memberships!&quot;", "time": 1583538906}, {"by": "arcticbull", "id": 22508389, "kids": [{"by": "paxys", "id": 22508484, "text": "Yes. There&#x27;s a reason companies like Digital Ocean, Heroku, OVH, ZEIT, Joyent, Rackspace, Linode, Cloudflare and many more have been able to survive and grow rapidly in an AWS-dominated space. None of them are competing by undercutting Amazon in price.", "time": 1583538524}, {"by": "DarthGhandi", "id": 22509120, "text": "Ahh yes, the mythical four nines.<p><a href=\"https:&#x2F;&#x2F;medium.com&#x2F;@guisebule&#x2F;the-sla-is-a-lie-babd16d629d2\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@guisebule&#x2F;the-sla-is-a-lie-babd16d629d2</a>", "time": 1583545097}, {"by": "Dylan16807", "id": 22509936, "text": "&quot;Better&quot; in a niche-filling way, not a &quot;this is very well engineered, but for my use case it&#x27;s very overengineered&quot; way.", "time": 1583558727}], "text": "... better than AWS with its SLAs, that every major company relies on to some extent?", "time": 1583537571}], "text": "The point is not to do it cheaper but better.", "time": 1583533442}, {"by": "vincentlee", "id": 22509000, "text": "market your product better, steal better companies people, lie, play political games, leverage relationships, kill<p>so many options", "time": 1583543782}], "text": "Everybody with more money than you can always undercut you in anything you ever do so why bother ever trying to do anything", "time": 1583530918}, {"by": "yourapostasy", "id": 22507895, "kids": [{"by": "dannyw", "id": 22510801, "text": "Had about 20k objects and lost one (405s no matter what) about six month in.<p>I didn’t think much about it, but I guess I was really unlucky.", "time": 1583573807}], "text": "&gt; ...they&#x27;d build a sorta-reliable S3...<p>From operational experience reports of S3 I&#x27;ve seen out there and discussions [1], including on HN [2], once you reach a large enough object count, S3 is &quot;sorta-reliable&quot;. Objects will disappear. The durability claim is not SLA-enforced [3], which is uptime-oriented. The only remedy is a service credit.<p>[1] <a href=\"https:&#x2F;&#x2F;www.theregister.co.uk&#x2F;2018&#x2F;07&#x2F;19&#x2F;data_durability_statements&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.theregister.co.uk&#x2F;2018&#x2F;07&#x2F;19&#x2F;data_durability_sta...</a><p>[2] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14880617\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=14880617</a><p>[3] <a href=\"https:&#x2F;&#x2F;aws.amazon.com&#x2F;s3&#x2F;sla&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;aws.amazon.com&#x2F;s3&#x2F;sla&#x2F;</a>", "time": 1583533321}, {"by": "kmod", "id": 22507829, "kids": [{"by": "notyourday", "id": 22507933, "kids": [{"by": "late2part", "id": 22508513, "kids": [{"by": "jjeaff", "id": 22510058, "kids": [{"by": "dannyw", "id": 22510792, "text": "1 month of sales hunting has got me a PC rig for literally 2&#x2F;3rd of the cost of buying without waiting. And this was an optimised build in the first place.", "time": 1583573598}], "text": "That&#x27;s not what they said. They pay more than small vendors, sometimes.<p>If you are able to take advantage of sales and clearance deals here and there, you are very likely to get a lower price than even the biggest buyers.", "time": 1583560817}], "text": "you are wrong that AWS pays more than small vendors.", "time": 1583538830}], "text": "This is actually not correct.<p>Because of AWS scale it cannot be the cheapest. Amazon cannot use odd lots or small lots, which means that it has very few possible suppliers and those suppliers will never be the cheapest.<p>Same goes for the network infrastructure. While it is possible buy 100Gbit&#x2F;sec at a throw away price to because some sales person needs to make his numbers and neither he nor his director of sales thinks Kmod Hosting would be able to fill the pipe it is buying, Amazon would need 900Gbit&#x2F;sec for their exit and no one at the vendor is going to blink at making Amazon pay higher price than Kmod Hosting.", "time": 1583533715}], "text": "I agree that AWS has economies of scale that makes it hard to build a better&#x2F;cheaper S3, but one way you can get around this problem is by building to lesser requirements.  S3 has to work for all use cases, but if you know you need less of something costly (say, less IOPs) you can build a system that&#x27;s cheaper than S3 even if the individual components are more expensive than S3 is paying.", "time": 1583532768}, {"by": "vidarh", "id": 22510181, "text": "They probably could,but they&#x27;re showing no sign of wanting to compete on cost.<p>E.g bandwidth costs on AWS are high enough that if you actually serve up lots of data from S3 you can typically afford to rent servers to cache all of it &#x27;in front&#x27; of AWS and still save a ton of money.<p>S3 only gets close to competitive if you never access the data from outside of AWS.<p>Which gets to the point: If you use an AWS service like S3, you pretty much has to use other AWS services if you want the cost to be even somewhat reasonable in aggregate.<p>They don&#x27;t need to compete on cost, because once they get you to buy into one set of services, moving any one set of services off AWS gets more painful and&#x2F;or costly, and a full migration looks too scary for most people.<p>S3 will never be priced to undercut anything but big players for that reason. They need to be competitive with Google and Azure, because those guys can offer to offset transitioning costs and generally aggressively target AWS customers.<p>A small player isn&#x27;t the same threat even if substantially cheaper.", "time": 1583563080}, {"by": "Taek", "id": 22508151, "kids": [{"by": "jrochkind1", "id": 22508272, "kids": [{"by": "Taek", "id": 22508368, "text": "<a href=\"https:&#x2F;&#x2F;blog.sia.tech&#x2F;skynet-bdf0209d6d34\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.sia.tech&#x2F;skynet-bdf0209d6d34</a> - this is probably the best thing we have at the moment.<p><a href=\"https:&#x2F;&#x2F;support.sia.tech&#x2F;article&#x2F;dk91b0eibc-welcome-to-sia\" rel=\"nofollow\">https:&#x2F;&#x2F;support.sia.tech&#x2F;article&#x2F;dk91b0eibc-welcome-to-sia</a> - this support article is also a good introduction to the network and why it was built", "time": 1583537384}, {"by": "beedrillzzzzz", "id": 22508377, "kids": [{"by": "easygenes", "id": 22508866, "kids": [{"by": "ethbro", "id": 22509161, "text": "On the other hand, I am filled with positive associations at the name.<p>Reliability, redundancy, disaster recovery, cost cutting, and absolute focus on execution!", "time": 1583545557}, {"by": "Evidlo", "id": 22509151, "text": "See Soylent.", "time": 1583545407}], "text": "I cringe every time a project uses the name &quot;Skynet&quot;. First, it&#x27;s overused. Second, it&#x27;s literally the name of the AI project that went rogue and tried to kill all the humans in the Terminator movie universe. Not exactly the best association. Just find another name.", "time": 1583542273}], "text": "Website: <a href=\"https:&#x2F;&#x2F;sia.tech&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;sia.tech&#x2F;</a><p>Also take a look at Skynet, a file sharing protocol built on top of Sia: <a href=\"https:&#x2F;&#x2F;siasky.net&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;siasky.net&#x2F;</a>", "time": 1583537468}], "text": "Where do I find the introduction what Sia is? I tried clicking around in the headers from OP, but couldn&#x27;t find it within my very lazy tolerance.", "time": 1583536478}, {"by": "ineedasername", "id": 22509344, "text": "What aspect of this infrastructure is user-owned?", "time": 1583548673}, {"by": "KarlKemp", "id": 22510176, "text": "You re certainly reimagining the marketing slang of a few years ago (a decade for the gratuitous dig at Google Reader)", "time": 1583562981}], "text": "Sia is a lot more than a low cost storage platform. It&#x27;s a full reimagining of how the cloud should work with an emphasis on user ownership and control, open access for developers, and ultimately decentralization that allows users to be certain their applications will always work (no more &quot;RSS Reader is shutting down&quot;).<p>This post is intended to address people who do not feel that decentralization can be cost effective at scale.", "time": 1583535447}, {"by": "risyachka", "id": 22510461, "text": "Amazon has huge margins. They could sell you the same services for waaaaaay less money. They just won&#x27;t.", "time": 1583567938}, {"by": "jknoepfler", "id": 22507648, "kids": [{"by": "Hamuko", "id": 22507735, "text": "Care to share any funny stories?", "time": 1583531991}], "text": "having worked at aws, all I&#x27;ll say is I think you&#x27;re wildly over-estimating their agility", "time": 1583531322}, {"by": "animalnewbie", "id": 22509599, "text": "&gt; (paraphrased) domain experience means they ae best<p>As someone who has worked with a couple of market leaders in their respective fields i want to disssaude anyone who would listen of this notion. NO, the market leaders aren&#x27;t doing things optimally. Some things are downright stupid.", "time": 1583552618}, {"by": "scarface74", "id": 22507976, "text": "Isn’t that what AWS S3 one zone infrequent access is?", "time": 1583534000}], "text": "Here&#x27;s the issue. We know that due to economy of scale and domain experience, AWS will always have the lowest cost (to Amazon) for storage -- whether that&#x27;s totally-reliable storage, or sorta-reliable. If there was a demand for sorta-reliable, they&#x27;d build a sorta-reliable S3 and undercut you. Then, blockchain adds inefficiency. Therefore, it&#x27;s basically impossible for any blockchain solution to have a lower total cost to provide storage.", "time": 1583530349}, {"by": "kllrnohj", "id": 22508953, "kids": [{"by": "notyourday", "id": 22509072, "text": "You are going to get a 4U server that takes 60 disks and populate it with SAS cards driving them using SAS-2-SATA cables.", "time": 1583544566}], "text": "The buildout in the article doesn&#x27;t work. You can&#x27;t plug in that 4-lane SAS SFF-8087 splitter cable into that motherboard. You&#x27;re only getting 8 hard drives per motherboard with that setup, not 32.<p>That puts the cost of 192 TB at more like $6240‬, not  $4945. Could be less if you find a good deal on mini-SAS PCIE cards, but still going to be substantially higher than $4945.", "time": 1583543322}, {"by": "anonymousiam", "id": 22507426, "kids": [{"by": "prepend", "id": 22507443, "kids": [{"by": "jakewalker", "id": 22507694, "kids": [{"by": "rpdillon", "id": 22508988, "text": "It does sound like that!  The mistake there was to assume the failure of one mortgage was statistically independent of the failure of another, which is obviously incorrect for many failure scenarios.  In this case, it it would be similar if all nodes were in, say, the same datacenter.  That doesn&#x27;t appear to be the case, but there may be other dimensions on which the network lacks the required diversity to support the reliability claims (disk vendor and age...? There must be others.)", "time": 1583543666}, {"by": "feross", "id": 22508065, "kids": [{"by": "allendoerfer", "id": 22519856, "text": "Or computers for that matter. Deep down it is not really about 1s and 0s, more like thresholds in between 1 and 0.<p>To me a big part of computer science is abstracting away unreliable details to make them seem reliable.", "time": 1583694281}], "text": "Your mind is going to be blown when you learn how TCP&#x2F;IP works.", "time": 1583534613}, {"by": "justinmeiners", "id": 22509158, "kids": [{"by": "iampims", "id": 22509271, "kids": [{"by": "justinmeiners", "id": 22509728, "text": "True. It would be interesting to analyze what others aspects are correlated.", "time": 1583555241}], "text": "They all run the same software stack though, so despite being deployed on diverse hardware, so they can’t claim to only have independent failure modes.", "time": 1583547380}], "text": "Not really. Just probability.\nIf you have fully redundant services then ALL of them have to go down to have an outage.\nSuppose you 5 copies with 75% uptime each.\nThe probability that all of them are down is 0.25^5 ~ 0.0009<p>Now of course that assumes they are uncorrelated, but since Sia nodes are distributed across the internet, that&#x27;s  likely as opposed to multiple servers at a few data centers like AWS.<p>Turns out mortgage bonds tend to be correlated.", "time": 1583545508}, {"by": "__jal", "id": 22507861, "kids": [{"by": "kybernetikos", "id": 22508773, "kids": [{"by": "mcdevilkiller", "id": 22510924, "text": "No, they are mostly made of air, which floats \n(Partial sarcasm, as that is what makes them float)", "time": 1583577189}], "text": "It&#x27;s a great saying, but aren&#x27;t all large ships these days made out of components that don&#x27;t float individually?", "time": 1583541200}], "text": "Reminds me of a saying from the first dot.com crash. (Or at least I heard it then first.)<p>Tying two bricks together doesn&#x27;t make them float.", "time": 1583533082}, {"by": "zchrykng", "id": 22509652, "text": "I mean, the concept actually works, but you have to understand what is actually going into the bundled product. There is no reason you couldn&#x27;t bundle 100 million in mortgages that had a 10% default risk and sell 10 million of that bundle as AAA.<p>It is when you just start bundling everything and then saying the entire thing is AAA that the trouble starts.", "time": 1583553806}, {"by": "statictype", "id": 22508923, "text": "Except the people who put those sub prime mortgages in probably didn’t apply rigorous statistical analysis to their situation.", "time": 1583542944}, {"deleted": true, "id": 22508200, "time": 1583535856}], "text": "Sounds kinda like the people who thought that bundling a bunch of bad mortgage debt together in slices could get it rated AAA.", "time": 1583531687}, {"by": "Aunche", "id": 22507920, "kids": [{"by": "teknopurge", "id": 22509894, "kids": [{"by": "Dylan16807", "id": 22510254, "text": "&gt; not to mention actually _downloading_ of the data from the Sia network will take that $1.50&#x2F;TB&#x2F;mth to $70&#x2F;TB&#x2F;mth<p>You really need to back that math up.<p>Here&#x27;s my math: 10mbps is over 3TB per month at max utilization, so let&#x27;s say it&#x27;s good enough for either 2TB throughput with semi-even use, or 1TB throughput if the use is really focused on part of the day.<p>When buying transit in bulk in the US, Google tells me that 10mbps was very roughly $8.50 a month in 2017, $4.50 a month in 2018, and $2.50 a month in 2019.<p>Are you expecting the data to be rebuilt every single day or something?", "time": 1583564672}, {"deleted": true, "id": 22513571, "time": 1583610210}], "text": "This is why the post is a red-herring. You cannot use storage if you cannot get to it.  Talking about the price of disk space&#x2F;mth is absolutely useless without talking about the bandwidth required to use it, which means, if you want to go big-boys-math, 95% bandwidth and peering agreement pricing.  That $1.50 with all the network chatter between hosts for replication&#x2F;repair&#x2F;etc., not to mention actually _downloading_ of the data from the Sia network will take that $1.50&#x2F;TB&#x2F;mth to $70&#x2F;TB&#x2F;mth.<p>Talking about the disk-space  pricing is, IMO, disingenuous.  Talk about the math for an all-in use-case of the service.  I appreciate what the OP is going for, however, hand-waving around uncomfortable critical items like bandwidth cost for the Sia network is not a good look.", "time": 1583558161}, {"by": "im3w1l", "id": 22508126, "text": "You will be able to boast of 99.9999% uptime up until that sprinkler goes of. And with luck, it could be decades until it does.", "time": 1583535223}], "text": "Redundancy is kind of meaningless unless if you have sufficient diversity. If all your replicas are located on the same rack, you&#x27;re screwed if there is a minor disaster like a sprinkler going off.", "time": 1583533498}, {"deleted": true, "id": 22507568, "time": 1583530699}], "text": "Redundancy, I assume. Lots of unreliable facilities and nodes can be very durable in aggregate.", "time": 1583529805}], "text": "The third sentence of your Medium article says; &quot;Despite this, the Sia network is able to achieve 99.9999% uptime for files.&quot;  How do you achieve this in a &quot;not a highly reliable facility&quot;?", "time": 1583529700}, {"by": "toolslive", "id": 22510870, "text": "OTOH, your object storage can be even cheaper if you don&#x27;t do Reed-Solomon erasure coding, but use rateless erasure codes. For example, online codes[1] have been used by Amplidata to have more reliable storage with lower overhead. There are downsides however (no partial reads, no mutability, ....)<p>[1] <a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Online_codes\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Online_codes</a>", "time": 1583575795}, {"by": "samstave", "dead": true, "id": 22509014, "kids": [{"by": "justinmeiners", "id": 22509176, "text": "You&#x27;re taking &quot;cutting corners&quot; out of context. He is describing how individual nodes don&#x27;t need to run at the standards of regular data servers and are hence cheaper, but in aggregate provide a reliable service.<p>&gt; So, I assume you’re quite young.<p>So you do you have a technical criticism?", "time": 1583545757}], "text": "Why the heck would one want to store data in a non highly reliable anything run by a team who is building around cutting corners???<p>Wtf am i missing here?<p>—-<p>So, I assume you’re quite young. ~31 or so...<p>I say this because youre not speaking with a level of professionalism one would ostensibly have when talking about storing (and providing access to) another’s data...<p>And if your actual business model is focused on cutting corners to save costs in exchange for reliability - then the obvious is that you seek to cut corners and costs in all other aspects of your business and are telling people “STAY THE FUCK AWAY” from your business... unless your customers are of similar ilk, and if not - then their data isn&#x27;t even important enough to persist, your systems or theirs...", "time": 1583543934}], "text": "Author here. A lot of these numbers are drawn from experience in the mining world, where people realized that when cost is the ultimate bottom line, a lot of corners can be cut.<p>Sia systems don&#x27;t need a ton of networking. I ran the networking buildout costs by some networking people, and again it comes down to cutting corners. If you only need 10 gbps per rack, if you don&#x27;t mind having extra milliseconds added, etc, you can get away with very scrappy setups. The whole point is that it&#x27;s not a highly reliable facility.", "time": 1583528700}, {"by": "chx", "id": 22507442, "kids": [{"by": "TrueDuality", "id": 22507651, "kids": [{"by": "Aeolun", "id": 22508253, "kids": [{"by": "Dylan16807", "id": 22510333, "text": "Here&#x27;s the histogram from their AMA: <a href=\"https:&#x2F;&#x2F;i.imgur.com&#x2F;iVEuwUT.jpg\" rel=\"nofollow\">https:&#x2F;&#x2F;i.imgur.com&#x2F;iVEuwUT.jpg</a><p>About a third of the users are under 100GB.<p>Another third is under 500GB.<p>13% from 500GB to 1TB.<p>9% from 1TB to 2TB.<p>8% from 2TB to 5TB.<p>5% above that.<p>And they cited raw costs of over $3.50 per TB.  But of course that&#x27;s with real datacenters and non-shoddy equipment.", "time": 1583566045}, {"by": "chx", "id": 22508604, "text": "Don&#x27;t forget the vast amount of notebooks with SSDs that have less than 1TB storage to begin with.", "time": 1583539679}, {"by": "dannyw", "id": 22510806, "kids": [{"by": "Aeolun", "id": 22524290, "text": "In that case I’d also expect them to skip uploading the data, but everything is uploaded.", "time": 1583749880}, {"by": "lucb1e", "id": 22510963, "text": "They can&#x27;t deduplicate properly encrypted data, that will have to happen client-side. So while they can deduplicate your data (if you have a copy of a picture in multiple places or maybe even a game installed on multiple machines), it won&#x27;t work across users.", "time": 1583578014}, {"by": "jan6", "id": 22510928, "text": "they&#x27;d probably charge you the same anyway, even if THEY get it at basically free ;)", "time": 1583577272}], "text": "Backblaze deduplicates data right? So it doesn’t really cost them anything to back up your steam games.", "time": 1583573971}], "text": "If all their other customers on the $5&#x2F;month unlimited backup plan store less than 1TB, but since it’s really aggressive about backing up <i>everything</i> (no, please don’t back up my steam games) on your computer I think they go over that.", "time": 1583536288}], "text": "Backblaze is operating at their own economy of scale with dedicated deals with suppliers, custom bare bones hardware, optimized processes, etc. It&#x27;s always more expensive starting out as a little company for raw hardware and processes until you&#x27;re big enough and mature enough to get the deals and processes in place.<p>That is also not the only service that Backblaze offers and wasn&#x27;t their first. It could be that B2 is simply a way for them to offset their cost for extra capacity and are running it effectively near-cost for them.", "time": 1583531339}, {"by": "throwaway3157", "id": 22507631, "kids": [{"by": "pepemon", "id": 22509502, "text": "Who are you?", "time": 1583551017}], "text": "&gt; Can&#x27;t be more than 2.5 because Backblaze B2 already gives you $5&#x2F;TB&#x2F;Mo.<p>Well it can be, if they have a lot of inefficiencies. Backblaze could have more experienced engineers who overcame these. I assure you, I can accidentally design a very expensive storage system as I’m not that smart  ;)", "time": 1583531171}, {"by": "tgsovlerkhgsel", "id": 22508975, "text": "Scaleway C14 [1] gives the $2&#x2F;TB&#x2F;month that the title promises. Now, providing Sia storage space may be more expensive because you have to calculate costs for proof-of-storage (and may not be able to pull off the &quot;cold storage&quot; model, which may also only work in conjunction with a higher-priced low-latency offering), plus potentially more replication than a centralized service uses, but it does indicate that it&#x27;s probably not completely unrealistic.<p>[1] <a href=\"https:&#x2F;&#x2F;www.scaleway.com&#x2F;en&#x2F;c14-cold-storage&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scaleway.com&#x2F;en&#x2F;c14-cold-storage&#x2F;</a>", "time": 1583543519}, {"by": "ci5er", "id": 22510077, "text": "Backblaze doesn&#x27;t give you a random read&#x2F;write like DropBox, and wanting your disk drive back takes some time...", "time": 1583561117}, {"deleted": true, "id": 22507491, "time": 1583530209}], "text": "&gt; \nI didn&#x27;t read all their math but I expect their final result to be off by a factor of 2-5x.<p>Can&#x27;t be more than 2.5 because Backblaze B2 already gives you $5&#x2F;TB&#x2F;Mo.", "time": 1583529802}, {"by": "vikiomega9", "id": 22507309, "kids": [{"by": "wmf", "id": 22509032, "text": "<a href=\"https:&#x2F;&#x2F;blogs.dropbox.com&#x2F;tech&#x2F;2016&#x2F;05&#x2F;inside-the-magic-pocket&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blogs.dropbox.com&#x2F;tech&#x2F;2016&#x2F;05&#x2F;inside-the-magic-pock...</a><p><a href=\"http:&#x2F;&#x2F;static.googleusercontent.com&#x2F;media&#x2F;research.google.com&#x2F;en&#x2F;&#x2F;archive&#x2F;gfs-sosp2003.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;static.googleusercontent.com&#x2F;media&#x2F;research.google.co...</a><p><a href=\"https:&#x2F;&#x2F;queue.acm.org&#x2F;detail.cfm?id=1594206\" rel=\"nofollow\">https:&#x2F;&#x2F;queue.acm.org&#x2F;detail.cfm?id=1594206</a><p><a href=\"http:&#x2F;&#x2F;www.pdsw.org&#x2F;pdsw-discs17&#x2F;slides&#x2F;PDSW-DISCS-Google-Keynote.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.pdsw.org&#x2F;pdsw-discs17&#x2F;slides&#x2F;PDSW-DISCS-Google-Ke...</a>", "time": 1583544076}, {"by": "sydney6", "id": 22507465, "kids": [{"by": "statictype", "id": 22508933, "kids": [{"by": "tw04", "id": 22509686, "kids": [{"by": "toolslive", "id": 22510605, "text": "Some object stores do this, but aws S3 for example does not. You can list the contents of buckets, nicely sorted by name. You can mimic directory structures if you want.<p>However, you touched a key point: object stores are all about throughput, not latency. You can store at a GB&#x2F;s (if you have the pipes), but even checking if an object exists will cost you a few milliseconds.", "time": 1583570376}, {"by": "statictype", "id": 22510427, "text": "Got it. Thanks for explaining.", "time": 1583567398}], "text": "It means you access your object through a GUID.  Think about it like parking your own car vs. a valet.  When you park your own car you need to know the address of the garage you parked in, the floor you were on, and the spot you were in.  When you valet park, you hand the attendant a ticket and he brings your car back.<p>With a standard fileshare, you need to walk the filesystem to retrieve your file - this incurs a ton of metadata overhead.  It also means when you&#x27;ve got potentially billions of files in a directory, it can be slooooowww.  All the metadata requests also make it very chatty - so doing it over a WAN link tends to be extremely painful if it works at all.  Newer versions of SMB and NFS have done a lot to batch the metadata requests but they are still protocols meant to happen at extremely low latency inside a datacenter.", "time": 1583554310}, {"by": "tgsovlerkhgsel", "id": 22508983, "text": "My guess: No random write access to objects, you can (at best) append-only but often you can only append until the object is finalized, and cannot read it until it is finalized.", "time": 1583543630}, {"by": "toolslive", "id": 22510573, "text": "it&#x27;s like a key-value store, (or a dictionary). However, the values are objects (big blobs of data). This means you can&#x27;t update parts of objects without rewriting the blob. However, most of the object stores offer metadata operations (move, tag, ...), concat of n objects into 1 and partial reads.", "time": 1583569958}], "text": "What does object-based mean? How is an object different from a file (which I presumed was a collection of blocks)?", "time": 1583543058}, {"by": "londons_explore", "id": 22508342, "text": "Google&#x27;s clusters are all block and file based (depending on what layer you want to use them at)", "time": 1583537066}], "text": "Storage Systems of this scale are thesedays almost exclusively built around object based storage rather than &quot;legacy&quot; block or file backed solutions. I guess today, min.io is would be the way to go. (to &quot;go&quot;.. little pun on the end:)", "time": 1583529971}, {"by": "ghostpepper", "id": 22507387, "kids": [{"by": "Mave83", "id": 22510623, "text": "Yes, with croit.io you can manage Ceph clusters with ease, reducing Laber costs and increase reliability.<p>We build clusters of low PB scale that have a TCO with everything from labor to hardware, from financing to electric, from routers to cables and can be run below 3€&#x2F;TB. For that you can store data in Block(rbd, iscsi), Objekt(S3, swift) or Filestorage(CephFS, NFS, SMB), high available on Supermicro hardware in any datacenter worldwide.<p>Feel free to contact us or use our free community edition to start your own cluster.", "time": 1583570517}], "text": "I am not the op nor an expert on this, but I think <a href=\"https:&#x2F;&#x2F;ceph.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;ceph.io&#x2F;</a> targets clusters of this scale.", "time": 1583529425}], "text": "&gt; exabyte-scale storage system<p>Somewhat of a random question, can you point me to some state of the art research?", "time": 1583528888}, {"by": "z3t4", "id": 22507479, "kids": [{"by": "jan6", "id": 22510950, "kids": [{"by": "Dylan16807", "id": 22515769, "text": "You need to trust that <i>not too many</i> of them will have that happen at the same time.<p>Which is not that hard to do.<p>And all those protections in a datacenter are far from free.", "time": 1583632612}], "text": "that&#x27;d need trust that they won&#x27;t run off with your drives, their basement won&#x27;t get flooded, there aren&#x27;t power outages often, they have good protections against surges and whatnot...\nwhich at ANY datacenter, is automatically included ;)", "time": 1583577696}], "text": "Storage can be far cheaper when decentralized. Sending data over the Atlantic is super expensive compared to LAN networking. Almost all content providers peer with ISP&#x27;s with onsite hardware. But why stop there, put the &quot;racks&quot; in ppl&#x27;s basements. Data storage is very compact now a days, you can probably fit 100 TB is a shoe-box.", "time": 1583530060}, {"by": "notyourday", "id": 22507418, "text": "We have done this calculation and even if you put your gear into Equinix&#x2F;Digital Realty in the most expensive places  and use Backblaze-type setup ( which is not optimized and buying retail) bringing 10Gbit to every 4U the price for double-writes at 5TB disks are $10&#x2F;year per TB.", "time": 1583529621}, {"by": "FalconSensei", "id": 22508732, "kids": [{"by": "tlb", "id": 22508888, "text": "Many businesses have TB of data they upload and keep for several years, looking at it once or twice over that time if ever. For these you could provision monthly bandwidth as low as 1&#x2F;30th of the total storage.", "time": 1583542449}, {"by": "Dylan16807", "id": 22515806, "text": "It says right there in the article that bandwidth is charged for separately.  So you just buy a line of appropriate size, based on actual usage measurements. \n And each one of these rigs only needs a gigabit connection to upload&#x2F;download its full capacity each month, which means the network equipment costs can be minimal.", "time": 1583633091}, {"by": "jan6", "id": 22510956, "text": "have you ever heard of backups and archiving? ;)\nthere are lots of scenarios when you&#x27;d want to write some amount, but not read it back for a while, if ever...", "time": 1583577864}], "text": "&gt; Hard drives are a surprisingly low percentage of the cost of a storage system<p>THIS! There&#x27;s no use of a 2TB storage if you can&#x27;t upload&#x2F;download this amount each month", "time": 1583540743}, {"deleted": true, "id": 22507262, "time": 1583528540}, {"by": "late2part", "id": 22508509, "text": "I agree with you.  Not 2-5x but they are rounding down on costs and optimistic on risks.", "time": 1583538791}, {"by": "winfred", "id": 22508335, "kids": [{"by": "prostheticvamp", "id": 22509615, "text": "It seems you’re getting heavily downvoted. I think it’s because CPU and memory are not missing.", "time": 1583552884}], "text": "&gt;I didn&#x27;t read all their math but I expect their final result to be off by a factor of 2-5x.<p>I looked at their parts list and it&#x27;s obvious they aren&#x27;t serious. CPU is missing, memory is missing, SAS to SATA cables, but no SAS controller, no mounting for the system board. Low effort at best.", "time": 1583537008}], "text": "I worked on the design of Dropbox&#x27;s exabyte-scale storage system, and from that experience I can say that these numbers are all extremely optimistic, even with their &quot;you can do it cheaper if you only target 95% uptime&quot; caveat.  Networking is much more expensive, labor is much more expensive, space is much more expensive, depreciation is faster than they say, etc etc. I don&#x27;t think the authors have ever done any actual hardware provisioning before.<p>I didn&#x27;t read all their math but I expect their final result to be off by a factor of 2-5x.  Hard drives are a surprisingly low percentage of the cost of a storage system.", "time": 1583527437}, {"by": "walrus01", "id": 22507164, "kids": [{"by": "Ajedi32", "id": 22507627, "kids": [{"by": "qes", "id": 22515781, "text": "&gt; Think Bitcoin mining farm, not Backblaze datacenter. Any corners that can be cut will be.<p>And yet Sia is about half the cost of Backblaze (i.e. not much savings).<p>Hard to imagine situations where this is a good trade-off.", "time": 1583632726}, {"by": "throwaway3157", "id": 22507688, "kids": [{"by": "Ajedi32", "id": 22507736, "kids": [{"by": "ac29", "id": 22509273, "kids": [{"by": "Ajedi32", "id": 22509959, "text": "By reliable in this context I mean robust against hardware failure. (Including the failure of entire storage sites.) The OP explains the math and associated assumptions for how they derived that &quot;99.9999%&quot; figure, and acknowledges that since the calculated chance of data loss due to hardware failure is so infinitesimally small, other failure modes outside of what they modeled are likely to dominate.<p>As for the relatively small number of hosts at present, 895 is more than enough for 10-of-30 redundancy to work &quot;as advertised&quot;. You really only need 30 hosts technically. The bigger issue I think is the relative immaturity of the software. Sia is still pretty new compared to most other data storage systems; and although I&#x27;ve never heard of any software bugs in Sia resulting in data loss, that doesn&#x27;t mean such a bug will never be discovered. Be cautious, keep backups, and never rely on any single storage medium to store your data.", "time": 1583559022}, {"deleted": true, "id": 22509997, "time": 1583559647}], "text": "When you says Sia <i>is</i> reliable, do you mean it could be reliable if hypothetical X, Y, and Z things happen?<p>Because according to the homepage (sia.tech) there are only 895 hosts storing a total of 206TB right now, which is a very, very small amount. Backblaze, a relatively small player as compared to the big cloud providers has 1.1 million TB of raw capacity as of last year (redundancy reduces the available capacity, but still) [0].<p>[0] <a href=\"https:&#x2F;&#x2F;www.backblaze.com&#x2F;blog&#x2F;hard-drive-stats-for-2019&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.backblaze.com&#x2F;blog&#x2F;hard-drive-stats-for-2019&#x2F;</a>", "time": 1583547382}, {"by": "system2", "id": 22508929, "kids": [{"by": "ericflo", "id": 22509040, "text": "Users of Sia are the customers. So your question reduces to: who uses Sia? It used to mostly be interesting for customers interested in reliable large-file data backup on the cheap, but now it has expanded to customers looking to do content distribution on the web, etc.", "time": 1583544112}, {"by": "samstave", "dead": true, "id": 22509053, "text": "Shady neckbeards.<p>Seriously, the type of people with the scruples which would piss you off both in their tactics and their profits.<p>Lest we forget where the fuck FB, Myspace, Friendster, HI5 all came from: unscrupulous spamsters etc.. many made lots of money, but they’re still douchey in their inceptions...", "time": 1583544268}], "text": "It is not the answer to the question above. What is the type of customer uses this company?", "time": 1583543017}, {"deleted": true, "id": 22508300, "time": 1583536705}], "text": "Sia is <i>very</i> reliable from the customer&#x27;s perspective. Its only individual systems and storage pools that have lax uptime requirements. Thanks to some clever network-level redundancy mechanisms (10-of-30 redundancy), 95% uptime at the storage pool level translates to 99.9999% uptime from the customer&#x27;s perspective. See the &quot;Uptime Math&quot; section in the OP for details.", "time": 1583531992}], "text": "Who are the customers for such unreliable systems?", "time": 1583531629}, {"by": "SrslyJosh", "dead": true, "id": 22508299, "text": "I&#x27;ll pass, thanks.", "time": 1583536699}], "text": "They&#x27;re not talking about a datacenter. Datacenters need to be reliable. Sia storage pools don&#x27;t, because security and reliability is achieved at the global network level, not at the level of individual systems or storage pools. 95% reliability means you can be down for two whole weeks out of every year and still be well within acceptable uptime requirements.<p>Generators? Who needs those? Just wait for the power to come back on. UPS? Why bother? Square footage? Stick some wooden shelves in the cheapest building possible. Cooling? Locate in a cold climate and buy some window fans.<p>This isn&#x27;t anything like the sort of infrastructure you&#x27;re used to dealing with. Think Bitcoin mining farm, not Backblaze datacenter. Any corners that <i>can</i> be cut <i>will</i> be.", "time": 1583531123}, {"by": "Taek", "id": 22507224, "kids": [{"by": "walrus01", "id": 22507246, "kids": [{"by": "ajross", "id": 22507267, "kids": [{"by": "walrus01", "id": 22507279, "kids": [{"by": "ajross", "id": 22507414, "text": "I think it very much depends on the desk.  I mean, power alone  at my home just barely reaches three nines.  Internet connectivity glitches out occasionally.  I&#x27;ll fat finger configurations and reinstall stuff for some more hours a year.  It all adds up.<p>You&#x27;re right that you can take the same hardware, add a $70 UPS and some thought and care, and do much, much better.  But my point was only that &quot;95%&quot; is a trivially achievable goal even in the most naive setups, which makes me treat their analysis with a little more credence than most folks here.", "time": 1583529610}, {"by": "ubercow13", "id": 22513632, "text": "Which should give you even more confidence in Sia&#x27;s reliability, no?", "time": 1583610794}], "text": "Things on my desk are meeting three nines or better of uptime at present, 95% would be 18 days hard down per year.", "time": 1583528688}], "text": "Per-site reliability (beyond a stated&#x2F;assumed 95%, which is right around the &quot;I put a computer on my desk&quot; level) isn&#x27;t a design goal, though.  You can argue with their math or their assumptions, but you can&#x27;t say they&#x27;re wrong for not designing in the reliability features you list above.", "time": 1583528570}], "text": "If all you intend to do is generate hashes and run for the exits when your mining equipment is no longer economical, due to difficulty increase, sure.<p>Reliable data storage for paying customers is a very different thing.", "time": 1583528379}, {"by": "thawaway1837", "id": 22507259, "text": "Crypto currency servers didn’t need to last though. Their primary components were being replaced regularly with the latest generations.<p>Here they’re depreciating components over 7 years, so will those components last 7 years under those conditions?", "time": 1583528497}], "text": "Its super interesting to dive into the world of cryptocurrency mining, where some DCs are getting PUE of 1.1 or better with a buildout that&#x27;s basically amounts to shelves and box fans.<p>No generators, just eat the downtime. No batteries. No 24&#x2F;7 staff.  No racks, just shelves (folded sheet metal is cheap). Security varies from farm to farm.<p>These servers don&#x27;t need to run cool, as long as you are in a climate that doesn&#x27;t get over 100 degrees you can get away with fans and no AC.", "time": 1583528242}, {"by": "jrockway", "id": 22507315, "kids": [{"by": "walrus01", "id": 22507350, "kids": [{"by": "londons_explore", "id": 22508376, "kids": [{"by": "ineedasername", "id": 22509399, "text": "If you&#x27;re in the developed world, that isn&#x27;t going to fly. &quot;other buildings won&#x27;t burn down&quot; isn&#x27;t going to get you a pass on these things.", "time": 1583549480}, {"by": "generatorguy", "id": 22509567, "text": "Insurance?", "time": 1583552237}], "text": "In most places you don&#x27;t <i>need</i> to build to code, as long as you take other steps to mitigate risk.<p>Saying &quot;this entire building is designed to catch fire, and if it does, it won&#x27;t do harm to neighbouring buildings, people, or the environment&quot; is probably a good start.", "time": 1583537462}], "text": "OVH, the massive hosting company, is located in a former aluminum smelter next to a hydroelectric dam in Quebec. They keep costs as low as absolutely possible, but their operating costs as a whole are still considerably higher than something designed with one nine of uptime.<p>I get that you&#x27;re mostly joking by saying &quot;yeah sometimes everything shorts out&quot;, but we have electrical codes in the US&#x2F;Canada for a reason.", "time": 1583529170}, {"by": "mkl", "id": 22507908, "text": "&gt;  I also don&#x27;t have a use case for 95% availability. (That&#x27;s two weeks a year where your data is gone!)<p>Gone from only one of the places it&#x27;s stored.  Your data is still available even if just 10 out of 30 servers are online.", "time": 1583533420}], "text": "I think it&#x27;s interesting to dive into the economics of 95% uptime.  Maybe you don&#x27;t need full datacenter cooling; you can just locate in a cool climate and have a fan in the window blowing cold air in.  If there&#x27;s a blizzard, you lose your drives because snow blows in and melts on your drives.  If the chance of the blizzard * price of drives is less than needing 750W of cooling, then you win.  Yeah, sometimes everything shorts out.<p>Power is similar.  Maybe you just use solar and turn the drives off when it&#x27;s cloudy.  With enough distribution throughout the world, it will probably be sunny somewhere.<p>I haven&#x27;t done the math and I&#x27;m not saying it will work out favorably.  I also don&#x27;t have a use case for 95% availability.  (That&#x27;s two weeks a year where your data is gone!)  But it&#x27;s something that someone with the right needs could consider, and maybe come out ahead of someone shooting for 5 nines and drives that aren&#x27;t covered in snow.", "time": 1583528913}, {"by": "wmf", "id": 22507340, "kids": [{"by": "breakyerself", "id": 22507386, "kids": [{"by": "caymanjim", "id": 22507619, "kids": [{"by": "comex", "id": 22507707, "kids": [{"by": "bscphil", "id": 22510472, "text": "Although it&#x27;s certainly a typo, ~6 Mbits a second isn&#x27;t enough for more than poor quality 1080p video, roughly equivalent to streaming from Netflix or Hulu. If you were streaming a backup of a UHD Bluray, for example, the bitrate could be over 100 Mbps.", "time": 1583568103}, {"by": "caymanjim", "id": 22509516, "text": "Indeed. HD streaming seems to need about 5.4Mbps reliably. Spaces is working well enough, but sometimes I have to pause for ten minutes to buffer enough for the rest of the film. It usually works, but with variable bitrate it must spike at times.", "time": 1583551298}, {"by": "judge2020", "id": 22508120, "text": "I&#x27;d love to see someone try running a TV network off of DO spaces :)", "time": 1583535164}], "text": "Surely you mean Mbit, unless you’re streaming uncompressed video for some reason! :)", "time": 1583531793}, {"by": "harias", "id": 22508373, "kids": [{"by": "londons_explore", "id": 22508401, "kids": [{"by": "caymanjim", "id": 22509527, "text": "I&#x27;ve read this as well, so I didn&#x27;t try. I also don&#x27;t want to spend that much. I have 120 movies in Spaces and it only costs me about $8&#x2F;mo. My egress is under the free tier so far, and overages amount to about four cents per movie stream.", "time": 1583551520}, {"by": "ubercow13", "id": 22513653, "text": "Any evidence of that? Isn&#x27;t it likely that Google has plenty of commercial customers using this service with large amounts of data?", "time": 1583611004}], "text": "It&#x27;s &#x27;unlimited&#x27; until you use it too much, and then all your google accounts will get perma-banned...", "time": 1583537692}], "text": "Did you try GSuite Business account with 5 accounts? Google offers unlimited cloud storage if you get more than 5 accounts (5*12 = 60 USD&#x2F;month and no egress)", "time": 1583537447}], "text": "Dropbox is $10&#x2F;TB&#x2F;mo, which is the &quot;old&quot; industry standard (and still what most big guys charge). Backblaze is $5, but they charge egress fees, so usage matters. Dropbox doesn&#x27;t charge for egress, but there are limits on &quot;Public&quot; folder bandwidth (and you can&#x27;t pay for more if you max out). I don&#x27;t think there are limits on private content, but I bet there&#x27;s a soft throttle or some limit that will get you contacted.<p>There aren&#x27;t a lot of options for &lt;$5&#x2F;TB and they all charge egress. I&#x27;ve tried Backblaze, pCloud, and DO Spaces. My specific use case is storing full HD movies for streaming via Plex, which requires a fairly reliable 6Gbit&#x2F;second, and most of them can&#x27;t keep up. DO Spaces did the best of all the ones I tried, so I&#x27;m using that for now, but it&#x27;s just skating the edge of usability.", "time": 1583531077}, {"by": "animalnewbie", "id": 22509622, "kids": [{"by": "mekster", "id": 22511022, "text": "You could also say, MS Office is virtually free for the 1 TB these days.", "time": 1583579007}], "text": "For $6 per month (paid yearly) you get 1tb of OneDrive + office (desktop applications). My math maybe off but if you buy office every 3 years for $200 then you&#x27;re already even.... And 1TB of storage is just free really.", "time": 1583552971}, {"by": "caymanjim", "id": 22507634, "text": "I should add that places like Backblaze and pCloud and DO Spaces and others charge per GB stored, so if you&#x27;re using 1.3TB it&#x27;s prorated accordingly.", "time": 1583531185}, {"by": "john_minsk", "id": 22507476, "text": "0. You can only get 2 TB+", "time": 1583530048}], "text": "How much is a terabyte of dropbox storage?", "time": 1583529424}], "text": "They&#x27;re not talking about a real datacenter; they&#x27;re talking about a deathtrap crypto mine with hard disks instead of GPUs&#x2F;ASICs. Can&#x27;t you run a million hard disks off a consumer cable modem? ;-)<p>At the (slow) rate Sia is growing, I don&#x27;t think there will ever be enough demand to justify this design anyway.", "time": 1583529091}, {"by": "snazz", "id": 22507188, "text": "It sounds like they&#x27;re intentionally forgoing backup power and UPSs, as well as 24&#x2F;7 staffing. However, you&#x27;re right that this is probably pretty optimistic.", "time": 1583527850}, {"by": "late2part", "id": 22508588, "text": "If you’re paying more than $300k&#x2F;mo for 300kw of power in Quincy the DC sales guy probably bought your purchasing people a boat.", "time": 1583539581}, {"by": "late2part", "id": 22508543, "text": "I don’t really agree.  Retail Datacenter pricing all in should be well under $500&#x2F;kW; half of what they suggested.", "time": 1583539103}], "text": "I work in telecom&#x2F;datacenter infrastructure and this is fanciful. The whole way they take the wattage load of one machine and then hand wave away all of the rest of the costs of either building and running a datacenter, or paying ongoing monthly colocation costs... Is just scary. I truly don&#x27;t mean to offend anyone but this looks like a bunch of enthusiastic dilettantes.<p>Generators?<p>UPS?<p>Cooling costs?<p>Square footage costs for the real estate itself?<p>Security and staffing?<p>At the scale they intend to accomplish they will need at minimum several hundred kilowatts of datacenter space. Even assuming somewhere with a very low kWh cost of electricity, that much space for bare metal things isn&#x27;t cheap. Go price a lot of square footage and 300kW of equipment load in Quincy, WA or anywhere else comparable, the monthly recurring dollar figure will be quite high.<p>And all of that is before you even start to look into network costs to build a serious IP network and interconnect with transits and peers.", "time": 1583527691}, {"by": "mtlynch", "id": 22507420, "kids": [{"by": "marcinjachymiak", "id": 22508061, "text": "Another cost associated with your 2nd point is the collateral a host would have to burn to comply with take-down notices.", "time": 1583534557}], "text": "In 2018, I spent about six weeks running a series of tests to measure Sia&#x27;s real world costs. At that time, storage cost ~$4.50&#x2F;TB on Sia to back up large real world files (backups of DVDs and Blu-Rays).[0] Community members have re-run my tests every few months, most recently in October 2019, when the cost was measured at $1.31&#x2F;TB, though it&#x27;s worth noting that recent tests use synthetic data optimized to minimize Sia&#x27;s cost.[1] It&#x27;s also unclear how much the market value of Sia&#x27;s utility token affects these costs, as the price of Siacoin has fallen by ~80% since I conducted my original set of tests.<p>The calculations in today&#x27;s blog post account for the labor cost of assembling hardware, but leave out major other labor costs:<p>1. You need an SRE to keep the servers online. Sia pushes out updates every few months, and the network penalizes you if you don&#x27;t upgrade to the latest version. In addition, to optimize costs, you need to adjust your node&#x27;s pricing in response to changes in the market.<p>2. You need a compliance officer to handle takedown requests. Since Sia allows anyone to upload data to your server without proving their identity, there&#x27;s nothing stopping anyone from uploading illegal data to the network. If Sia reached the point where people are building $4k hosting rigs, then it&#x27;s safe to assume clients would also be using Sia to store illegal data. When law enforcement identifies illegal data, they would send takedown notices to all hosts who are storing copies of it, and those hosts would need someone available to process those takedowns quickly.<p>[0] <a href=\"https:&#x2F;&#x2F;blog.spaceduck.io&#x2F;load-test-wrapup&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.spaceduck.io&#x2F;load-test-wrapup&#x2F;</a><p>[1] <a href=\"https:&#x2F;&#x2F;siastats.info&#x2F;benchmarking\" rel=\"nofollow\">https:&#x2F;&#x2F;siastats.info&#x2F;benchmarking</a>", "time": 1583529644}, {"by": "reggieband", "id": 22507649, "kids": [{"by": "tastroder", "id": 22508308, "text": "Since you&#x27;re bringing up the website... I don&#x27;t get this marketing strategy. The cryptocurrency angle is just as off putting as telling me as a potential customer that my data will be stored on janky servers in unreliable places, no matter if the uptime is the same. OP even claims they have reliability and experience I&#x27;d consider but those aspects sure send signals that make me not want to deal with that stack.<p>Just looking at the website for Sia I see a bunch of fluffy marketing stuff, fair enough, that&#x27;s normal these days. But where is the selling point? <a href=\"https:&#x2F;&#x2F;sia.tech&#x2F;technology\" rel=\"nofollow\">https:&#x2F;&#x2F;sia.tech&#x2F;technology</a> tells me my data is stored securely and in a redundant manner, great, just like any storage provider. That is followed by &quot;Renters And Hosts Pay With Siacoin&quot; and talks about payment channels, which links to a wikipedia article and not something that tells me how I would even pay them, not to even talk about how much (I saw the calculator thingy on my way to that site, the messaging is still weird).<p>The &quot;Getting started&quot; call to action is a similar experience, a bunch of downloads, cool - I don&#x27;t even know if you&#x27;re right for me yet. I&#x27;m five levels deep into the &quot;Getting started guide&quot; linked there and so far found that I&#x27;d apparently have to deal with weird crypto exchanges to pay somebody for this, plus I couldn&#x27;t use most of my pretty standard tooling anymore (at least not without involving one of those proxy things on the getting started page that cover a few use cases, some of which seem to be operated by others?).", "time": 1583536796}, {"by": "ericflo", "id": 22509113, "text": "It&#x27;s live right now though, the community has deployed the infrastructure [1] and the pricing is approximately what they claim [2].<p>1. <a href=\"https:&#x2F;&#x2F;siastats.info&#x2F;hosts_network\" rel=\"nofollow\">https:&#x2F;&#x2F;siastats.info&#x2F;hosts_network</a><p>2. <a href=\"https:&#x2F;&#x2F;siastats.info&#x2F;storage_pricing\" rel=\"nofollow\">https:&#x2F;&#x2F;siastats.info&#x2F;storage_pricing</a>", "time": 1583545050}], "text": "I&#x27;m going through Sia&#x27;s website now. It seems this article is meant to bolster the claim on their website which states &quot;When the Sia network is fully optimized, pricing will fall somewhere around $2&#x2F;TB&#x2F;month.&quot; [1]<p>Call me skeptical but it seems that they aren&#x27;t committing to building out this infrastructure themselves or providing a specific amount of storage at this pricing. They seem to be outlining a potential infrastructure that some enterprising individual (or corporation) could use to provide storage at that price to &quot;renters&quot; within their marketplace.<p>I guess I&#x27;ll just wait until someone puts their money where their mouth is. Given that this is a marketplace, the fact that a theoretical setup could be built to provide some service doesn&#x27;t necessarily guarantee it will be built.<p>1. <a href=\"https:&#x2F;&#x2F;support.sia.tech&#x2F;article&#x2F;thvymhf1ff-about-renting\" rel=\"nofollow\">https:&#x2F;&#x2F;support.sia.tech&#x2F;article&#x2F;thvymhf1ff-about-renting</a>", "time": 1583531326}, {"by": "jakear", "id": 22507129, "kids": [{"by": "eyegor", "id": 22507313, "kids": [{"by": "Taek", "id": 22507458, "kids": [{"by": "eyegor", "id": 22508332, "text": "You included tdp but tdp &#x2F;= actual electrical power. Intel approximates it from base clock (practically all consumer motherboards ignore the tdp&#x2F;boost spec). AMD uses voodoo to calculate tdp, it&#x27;s a pure marketing number with no basis in power usage. To make matters worse, motherboards typically go nuts with voltage on consumer boards, and power draw can vary wildly depending on what instructions you&#x27;re using. There are a crap load of x86-64 extensions.<p>Yes, you forgot ram. And network chips, motherboard power delivery losses, motherboard power usage, cabling losses, etc. I&#x27;d guess it would total 50-100w, but feel free to current clamp the psu rails to get a realistic number.<p>As for the 95% uptime, I agree with you. I wasn&#x27;t considering how much breathing room that actually provides, I was just going with my instincts.", "time": 1583536994}], "text": "CPU TDP is accounted for, the CPU linked in the blog post draws 65w and that is used in the electricity calculations.<p>I did realize that I completely forgot about RAM, when I get back to a computer I&#x27;ll have to make some updates, but it won&#x27;t materially move the numbers, there&#x27;s 33% margin of error between the number in the spreadsheet and $2 &#x2F; TB &#x2F; Mo.<p>The $80 PSU is what I could link to from Newegg, I do have experience in industrial electronics, and I know from firsthand experience that you can buy a 10+year PSU at 93% efficiency for well under $80 at 300 watts. At that level, you&#x27;re going to be able to request all the required cabling as well, which means you&#x27;re getting a much better price than the $7 per cable linked in the post.<p>95% uptime means 18 days of downtime per year. Consumer grade PSUs and mobos do much better than that.", "time": 1583529925}], "text": "It&#x27;s outrageously low. They&#x27;re also fancifully assuming cpu tdp = electrical power, cooling = 0w, and another 0w to the motherboard&#x2F;network cards. And each box has 1 non-redundant, schmuck-grade $80 psu, as well as a consumer grade mobo. This would never be anywhere near their uptime.", "time": 1583528905}, {"by": "lucb1e", "id": 22510969, "text": "If you&#x27;re from the USA, perhaps just ×2 any price you read if that helps you get through the article. Work that needs doing doesn&#x27;t always need to be done in high-income&#x2F;high CoL places.<p>I earn about €26&#x2F;h before taxes in western Europe, an income which lets me live in relative luxury (not &quot;private jet&quot; luxury, but I literally do anything I want and still save more than a third of my income with a 36-hour work week), and that&#x27;s for security consultancy which is way more specialised than the job you&#x27;re talking about. I think it&#x27;s also above the national average, but I don&#x27;t have the statistics on hand. Not sure what the cost to the company is, I think they put in another hundred a month for health insurance or pension or something (they pay 50% and I pay 50%, though I don&#x27;t see why keeping 50% off my payslip helps anyone, an employer will just deduct that from the salary they can offer) plus some overhead for accounting and whatever, but it&#x27;s probably not that far off.", "time": 1583578209}, {"by": "Taek", "id": 22507300, "kids": [{"by": "ac29", "id": 22509342, "text": "Right, the people putting together servers for Dell or HP certainly are not getting paid $20 or $25&#x2F;hr. If your standard of quality is &quot;crypto shitbox&quot;, even $10&#x2F;hr seems more than enough. This is assuming that many of these storage farms are going to be in places like Vietnam or Romania, not the US or Germany.", "time": 1583548635}], "text": "Assembling computers and replacing drives is generally speaking unskilled labor, right there next to factory workers.", "time": 1583528827}, {"by": "chrisseaton", "id": 22507588, "text": "I don&#x27;t think they mean engineer time here - it&#x27;s assembling the servers, so technicians, and yeah I guess yeah like most people they aren&#x27;t paid like in-demand software engineers. This is how most people have to get to by!", "time": 1583530813}, {"by": "benhurmarcel", "id": 22507662, "kids": [{"by": "xmzx", "id": 22508124, "text": "Not to mention, this work isn&#x27;t technical in nature. It&#x27;s very quick to pick up, probably more so than landscaping tbh.", "time": 1583535206}], "text": "In some developed countries you can get qualified labor that cheap. For example in Southern or Eastern Europe. Not to mention developing countries of course.", "time": 1583531390}], "text": "&gt; That means about 2 hours of labor per rig. We’ll call that $50<p>Does that seem low to anyone else? I don’t really have any background in the area, but 25&#x2F;hr cost <i>to the company</i> would be less than 20&#x2F;hr pay for the skilled labor. Other countries are different of course, but in US I could make that much flipping burgers in the right area.", "time": 1583527401}, {"by": "ComputerGuru", "id": 22508153, "kids": [{"by": "kllrnohj", "id": 22508918, "kids": [{"by": "hddherman", "id": 22511015, "text": "I have gotten away with cheap PCIex1 2xSATA2 adapter cards, for roughly 10-15USD at the time of purchase. They did work, but this assumes a motherboard with room for lots of PCIe cards.<p>Edit: to clarify on the CPU usage, could a potential build also get away with a cheap AMD Athlon 3000G?", "time": 1583578838}, {"by": "ComputerGuru", "id": 22509341, "text": "Yeah, that cpu wasn’t listed at the time. It’s clear that this is a thought experiment and nowhere near worth the attention it is getting.", "time": 1583548632}], "text": "&gt; The buildout did not list a CPU.<p>It did, or does now anyway, the RYZEN 3 1200 for $95.<p>EDIT: Although the better option is the 3200G so that you can actually get a display output from the thing. Same price, so it doesn&#x27;t really change anything, but it does cut the CPU core count down a bit if that matters at all.<p>That said the buildout still doesn&#x27;t work because you can&#x27;t actually plug the &quot;sata splitter&quot; cable they linked into the motherboard. Because the splitter was actually a 4-lane SAS SFF-8087 breakout cable, and there&#x27;s no consumer motherboard with 8x of those connectors on it. Good luck finding even 1 or 2 of those connectors on a consumer board, and it sure as hell won&#x27;t be at dirt cheap prices.<p>So you either need 4x the computers they calculated, or you need to budget for add-in SATA&#x2F;SAS controller cards. Which, because they aren&#x27;t used in consumer land, are not cheap. You could go used, but that&#x27;s still going to increase the bottom line (and won&#x27;t be a reliable source of parts)<p>They also aren&#x27;t factoring in assembly time nor budgeting for that. Building these isn&#x27;t going to go very quickly.", "time": 1583542847}], "text": "There is way too much hand-waving and assuming going on this article. It is a load of BS that does not take into account real-world inefficiencies. e.g. sometimes buying in bulk is more expensive than buying at retail, esp when you need consistent supply. Sure, you may need only an hour of sysadmin time a day, but what sysadmin will let you employ them an hour a day? The buildout did not list a CPU. The assumptions about uptime are over-amortized, an outage given the resources they quote may average out to 95% uptime but their latency for getting systems back up is going to be absolutely terrible and I’d be surprised if outages were shorter than a day or two on average. They aren’t factoring in cooling. They aren’t factoring in the drastically reduced lifetime of drives in their ridiculously cramped and under-ventilated cubbies. They are completely ignoring diagnostic time, presuming they can only quote actual repair times, which is an absolute joke given the lack of smart hardware and enterprise DC management. They think they can average out throughout over the number of drives not taking into account per-channel limitations. They are not taking into account the extra time to build and dismantle systems in their hacked-together IKEA shelves. They are underestimating the costs of electricity at commercial rates. I could go on and on, but suffice to say that I would never, ever use their network for any purpose without another backup (which they don’t finger into their costs, of course ;). I thought B2 was risky; this is taking it to an entirely different level.", "time": 1583535464}, {"by": "growt", "id": 22507112, "kids": [{"by": "TheDong", "id": 22507288, "kids": [{"by": "ksec", "id": 22508413, "text": "&gt;and still only ends up hitting $5&#x2F;tb&#x2F;mo for their b2 service<p>$5&#x2F;TB&#x2F;Mo was B2 Price with Profits, better depreciation ( Blackblaze replaces drives more often ) and faster connection.<p>$2&#x2F;TB&#x2F;Mo was napkins maths with ~10% <i>Gross</i> Profits.", "time": 1583537796}, {"by": "notyourday", "id": 22507510, "kids": [{"by": "walrus01", "id": 22507574, "kids": [{"by": "notyourday", "id": 22507777, "kids": [{"by": "jauer", "id": 22509426, "kids": [{"by": "notyourday", "id": 22511186, "text": "All of them are on net and all of them have fiber already to the premises. Most of them have not just local loops but termination point for long distance carriers.", "time": 1583582788}], "text": "&gt; Not stores. Data centers.<p>Honestly, it doesn&#x27;t make much difference. \nDatacenters built for random corporations often only have connectivity to the local ILEC or MSO which is going to get you pretty poor pricing.", "time": 1583549969}, {"by": "geekone", "id": 22508262, "kids": [{"by": "notyourday", "id": 22511201, "text": "I toured three in the late 2000 about 20-25 minutes away from Philadelphia in different directions. I was told if we wanted to go further away there were dozens.<p>There&#x27;s its own market for 15-30k sq&#x2F;feet built out data processing facilities. It is something that compete with Equinix? Not at all, but it is definitely competitive with 3rd tier colos at the major carrier hotels at a fraction of the cost.", "time": 1583583091}], "text": "I didn&#x27;t expect to see Pep Boys as an example. Do&#x2F;did they have their own data centers?", "time": 1583536343}], "text": "&gt; Abandoned pepboys stores don&#x27;t usually have very good fiber connectivity. Backblaze and similar hosting&#x2F;storage companies move enough traffic that they need to be topologically close to major IX points.<p>Not stores. Data centers.<p>It is typically cheaper to get long distance fiber links than metro fiber and midsize data centers do not consume that much power, power which is plentiful outside the major metros, especially in the old manufacturing areas.<p>The real reason why companies do not go there is because it is not sexy and non-sexy places do not get &quot;ninja&quot; employees that would be passing brain teasers on a whiteboard.<p>&gt; Bulldozing empty land in Quincy and putting up a tilt-up concrete on slab dedicated purpose datacenter structure is much less costly than extensively retrofitting abandoned, 30, 40, 50 year old commercial real estate.<p>If you are doing it in a major metro then unless you get a big fat tax break your real estate taxes are going to kill you.", "time": 1583532356}], "text": "Abandoned pepboys stores don&#x27;t usually have very good fiber connectivity. Backblaze and similar hosting&#x2F;storage companies move enough traffic that they need to be topologically close to major IX points.<p>If all you want is cheap commercial real estate with cheap dollars per square foot figures, there are plenty of economically depressed areas within the United States that you could put things. Those areas usually have very poor fibre connectivity, fibre diversity, and choice of carriers.<p>I have previously explained this to a number of people who asked me, basically, why don&#x27;t all of these gigantic abandoned shopping malls get converted into Data center space? Two reasons: poor connectivity, and nowhere near enough electrical grid feed capacity (as proper three phase service) in terms of watts per square foot. Bulldozing empty land in Quincy and putting up a tilt-up concrete on slab dedicated purpose datacenter structure is much less costly than extensively retrofitting abandoned, 30, 40, 50 year old commercial real estate.", "time": 1583530745}], "text": "Backblaze is <i>very good</i> but they are definitely not efficient in $$ utilization.<p>Efficient $$ utilization is bread racks, built out data centers abandoned by the likes of PepBoys that landlords will part for $3&#x2F;sq foot per year and Google using servers without cases and velcros to keep hard drives attached.", "time": 1583530342}], "text": "Backblaze has tried to make their datacenter as efficient as possible, and still only ends up hitting $5&#x2F;tb&#x2F;mo for their b2 service, as a point of reference.", "time": 1583528735}, {"by": "atsmyles", "id": 22507379, "kids": [{"by": "walrus01", "id": 22507394, "text": "Backblaze has not only purchase costs but also considerable ongoing operational costs for salaries, network, datacenter.", "time": 1583529472}], "text": "According to your link, backblaze hardware costs are around 10x cheaper than OP&#x27;s estimate. $2.56 per TB (based on .05 per GB) vs $25 per TB.", "time": 1583529385}, {"by": "reilly3000", "id": 22507343, "text": "To be fair, it’s an extremely large napkin.", "time": 1583529125}], "text": "I feel like backblaze has already done most of this and has it in production [1].\nWhereas this is just done back of the napkin calculation.<p>[1] <a href=\"https:&#x2F;&#x2F;www.backblaze.com&#x2F;b2&#x2F;storage-pod.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.backblaze.com&#x2F;b2&#x2F;storage-pod.html</a>", "time": 1583527209}, {"by": "lalaland1125", "id": 22507256, "text": "One interesting point of reference is that backbaze currently charges $5 &#x2F; TB &#x2F; Mo. Assuming they haven&#x27;t changed their profit margin of 50% from 2017 (<a href=\"https:&#x2F;&#x2F;www.backblaze.com&#x2F;blog&#x2F;cost-of-cloud-storage&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.backblaze.com&#x2F;blog&#x2F;cost-of-cloud-storage&#x2F;</a>), then this would imply that they have a direct cost of roughly $2.5 &#x2F; TB &#x2F; Mo.", "time": 1583528443}, {"by": "aresant", "id": 22507260, "kids": [{"by": "pbhjpbhj", "id": 22507563, "kids": [{"by": "really3452", "id": 22507712, "kids": [{"by": "pbhjpbhj", "id": 22511147, "text": "Thanks", "time": 1583581913}], "text": "Yeah, they moved to gitlab: <a href=\"https:&#x2F;&#x2F;gitlab.com&#x2F;NebulousLabs&#x2F;Sia\" rel=\"nofollow\">https:&#x2F;&#x2F;gitlab.com&#x2F;NebulousLabs&#x2F;Sia</a>", "time": 1583531830}, {"by": "britmob", "id": 22507717, "text": "They’re on GitLab now.", "time": 1583531865}], "text": "I ended up at <a href=\"https:&#x2F;&#x2F;github.com&#x2F;NebulousLabs&#x2F;Sia\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;NebulousLabs&#x2F;Sia</a> and there&#x27;s no activity in the last two years, the latest issues are a few &quot;you broke my wallet with the update and my password doesn&#x27;t work&quot; from 2018.", "time": 1583530638}, {"by": "basch", "id": 22507947, "text": "I just removed the word blog so there was no subdomain, and it worked.  I mostly agree with what youre saying, but dont neglect the URL as part of the user interface.  The information was there and a click away.", "time": 1583533816}, {"by": "TecoAndJix", "id": 22515616, "text": "The word &quot;Sia&quot; in the first sentence links to their website", "time": 1583630748}], "text": "Top of Hacker News and there&#x27;s nothing clickable above the fold that takes me to the SIA website.<p>Content marketers and technical marketers - don&#x27;t miss the opportunity on Medium and other platforms to at VERY LEAST link to your homepage in the first section.<p>In fact that is at the top of this awesome piece of content marketing is a &quot;Sign Up&quot; button for Medium . . .", "time": 1583528507}, {"by": "border43", "id": 22507066, "kids": [{"by": "asdkhadsj", "id": 22507166, "text": "&gt; I&#x27;m looking forward to seeing this project mature as well as have some more layers build on top of it moving forward. I really wish the client offered synchronization or access across multiple devices. For now you have to try third party layers on top of Sia to accomplish this.<p>Yea I&#x27;d actually pick it up now and give it a try if it had this feature.", "time": 1583527694}, {"by": "mtzaldo", "dead": true, "id": 22507171, "kids": [{"by": "ajayyy", "id": 22507183, "text": "This isn&#x27;t a new project. It&#x27;s been around for many years.", "time": 1583527811}], "text": "Is this an ad?", "time": 1583527717}], "text": "I&#x27;ve been using Sia for about three months to backup some personal files. Nothing crazy, but it seems to work well.<p>I&#x27;m looking forward to seeing this project mature as well as have some more layers build on top of it moving forward. I really wish the client offered synchronization or access across multiple devices. For now you have to try third party layers on top of Sia to accomplish this.", "time": 1583526870}, {"by": "AaronFriel", "id": 22507506, "text": "Really smart people make this mistake a lot, so I&#x27;m wondering what Sia is doing to decorrelate failure rates. If hedge fund quants can turn mortgage tranches into a machine for massive correlated economic losses, can blockchain quants turn storage tranches into a machine for massive correlated storage losses?<p>Or if one of the major hyperscalers or datacenter operators decides to start selling storage to Sia, it seems likely that their control plane across datacenters could result in correlated failures. A networking outage for their AS could result in multiple datacenters appearing offline concurrently, for example.", "time": 1583530325}, {"by": "TheDong", "id": 22507299, "text": "This analysis entirely omits the cost of a sysadmin to manage the storage servers. Even if sia is assumed to do almost everything, and even if we only want 95% uptime, you still need someone to deal with software updates, hard drive monitoring, etc etc.<p>The profit of $570&#x2F;year&#x2F;box is not enough to pay a part-time sysadmin and still have any useful profit.", "time": 1583528816}, {"by": "simias", "id": 22507455, "kids": [{"by": "WrtCdEvrydy", "id": 22507732, "text": "I&#x27;m guessing there&#x27;s not a lot of 95% datacenters that don&#x27;t have heavy generators or UPS on site. You&#x27;d have to basically build a datacenter that has lower guarantees.", "time": 1583531961}], "text": "&gt;If we assume that the 30 hosts go offline independently<p>I wonder how reasonable this assumption really is. For regular CPU-bound crypto-mining we see that it tends to centralize geographically in zones where electricity, workforce and real-estate space to build a datacenter are cheap.<p>Assuming that Sia ends up following a similar distribution, it wouldn&#x27;t be surprising if several of these hosts ended up sharing a single point of failure.<p>Beyond that, if only copying stuff around three times to provide tolerance is enough to lower the costs to $2&#x2F;TB&#x2F;Mo, why aren&#x27;t centralized commercial offerings already offering something like that? Just pool three datacenters with 95+% uptime around the world and you should get the same numbers without the overhead of the decentralized solution, no? Surely the overhead of accounting for hosts going offline and redistributing the chunks alone must be very non-trivial. With a centralized, trusted solution it would be much simpler to deal with.<p>Or is the real catch that Sia has very high latency?", "time": 1583529906}, {"by": "theamk", "id": 22507765, "text": "I don&#x27;t think it is correct to say that the only options are &quot;host failures are truly independent&quot; or &quot;world war three&quot;.<p>The hosts are not ever going to be fully independent. There will be hundreds, if not thousands, host co-located in the same location -- likely of the cheapest grade, without any extras like fire alarms or halon extinguishers or redundant power feeds. \nA single fire (flood, broken power station) has a chance of taking out thousands of hosts simultaneously.<p>And there is management system as well -- AWS has thousands of engineers working on security. Will there be one at this super-cheap farm? What are the chances there will be farms with default passwords and password-less VNC connections? And since machines are likely to be cloned, any compromise affects thousands of hosts.<p>... and all of those things are made worse by the fact that if you store hundreds of thousands of files, your failure probability raises significantly. If a data center burns down, at least few of your files may be unlucky enough to be lost.", "time": 1583532278}, {"by": "sigstoat", "id": 22507669, "kids": [{"by": "Legogris", "id": 22508248, "kids": [{"by": "sigstoat", "id": 22508516, "text": "any of the expander (SATA, or SAS) things, yes, will be sharing bandwidth. but as you mention, it won&#x27;t be a limiting factor for mechanical drives. and considering the latency involved in this sort of retrieval, probably isn&#x27;t a problem regardless.<p>FWIW the break out cable they&#x27;ve listed is splitting up a connector that has 4 electrical channels onto 4 physically separate cables, so there&#x27;s no problem with it. they just don&#x27;t have anywhere to plug it in.", "time": 1583538853}], "text": "Isn&#x27;t a potential problem with &quot;SATA splitters&quot; also that all disks will share the same channel an therefore end up with worse performance? (Though I guess it won&#x27;t make a difference for mechanical drives)", "time": 1583536247}], "text": "at a minimum the facility will need some power conditioning and&#x2F;or insurance. you don&#x27;t want a brief power surge to eat all of your capital, and lockup fees, in one go.<p>&gt; For a 32 HDD system, you expect about 5 drives to fail per year. This takes time to repair and you will need on-site staff (just not 24&#x2F;7). To account for these costs, we will budget $50 per year per rig.<p>will you not also lose 6TB (times utilization) of your lockup every time a drive dies?<p>&gt; 8x 4 way SATA data splitters<p>you&#x27;ve linked to SAS breakout cables. they don&#x27;t plug into SATA ports, they plug into SFF-8087 SAS ports.<p>they cannot plug into the motherboard you&#x27;ve listed. nor have I ever seen one listed for retail sale that has 8 SFF-8087 ports.<p>the cheapest way to get 8 SFF-8087 ports is with some SAS expander card, and a SAS HBA. even scraping off eBay that&#x27;s another $50 per host, and two more components to fail.<p>there are also actual SATA expanders out there, but they last about 3 months before catastrophic failure in my experience.", "time": 1583531449}, {"by": "johnklos", "id": 22509174, "kids": [{"by": "chiefsucker", "id": 22510475, "kids": [{"by": "johnklos", "id": 22512845, "text": "Those are all just &quot;cloud&quot; talking points.<p>My time is worth a tremendous amount to me, which means I want to use my own hardware. &quot;The cloud&quot; does not guarantee reliability.<p>Any company that does any project that even slightly regularly requires compute &#x2F; storage can easily justify the time to do all the things you mentioned.<p>The fact that many companies have gone towards &quot;the cloud&quot; goes hand-in-hand with the fact that many companies use Windows. It&#x27;s clearly not the best thing to use to get things done, but the IT people don&#x27;t want to reduce their importance and the management people like the kickbacks and perks they get from buying certain thing from certain companies.<p>The savings look good on paper, but the reality is that they&#x27;re based on leaving out lots of information. I&#x27;ve helped several companies move from &quot;the cloud&quot; back to good, local compute resources because of the amount of money they were hemorrhaging to &quot;cloud&quot; providers.<p>For the most part, it&#x27;s all marketing bullshit.", "time": 1583603067}], "text": "That’s not really surprising, but people tend to forget about it. In the end somebody has to pay for ops. It’s business as usual, like it was a century ago.<p>There are cases where you can indeed save money by doing more by yourself. But how much time does it cost you and how much is your time worth?<p>How much time do you need to research, purchase, and eventually build your hardware? How much time do you need to get a decent data center deal? How much time do you need to bootstrap your setup? How much time do you need to regularly maintain your infrastructure?", "time": 1583568240}], "text": "Big deal. I charge $5 per TB per month and I&#x27;m not even trying to be cheap.<p>The economies of scale should make this much less expensive. Colocating your own machine in a real datacenter and hosting your own data shouldn&#x27;t still be cheaper than practically all of &quot;the cloud&quot; offerings, but it is. What does that tell you about &quot;the cloud&quot;? It&#x27;s marketing bullshit.<p>Sure, it&#x27;s fine for occasional use, but anyone using the hell out of &quot;the cloud&quot; can easily save money by using anything else.", "time": 1583545738}, {"by": "scrooched_moose", "id": 22507580, "kids": [{"by": "britmob", "id": 22507711, "text": "It cannot. I assume there’s an HBA thrown in the mix somewhere they did not mention.", "time": 1583531819}], "text": "Wait, how are they connecting 32 drives to that motherboard? They seem to be implying they are splitting each SATA plug 4 ways, which as far as I know is impossible.<p>The adapter they&#x27;re linking to is SF8087 to 4x SATA, not SATA to 4x SATA (which shouldn&#x27;t exist). That motherboard doesn&#x27;t have SF8087, it has 8 SATA3 connections.<p>Unless I&#x27;ve missed something big, SF8087 can not be plugged into SATA3.", "time": 1583530777}, {"by": "UI_at_80x24", "id": 22507115, "text": "From their site:\n[1]\nSia is a variant on the Bitcoin protocol that enables decentralized file storage via cryptographic contracts<p>[1]<a href=\"https:&#x2F;&#x2F;sia.tech&#x2F;sia.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;sia.tech&#x2F;sia.pdf</a>", "time": 1583527254}, {"by": "krick", "id": 22508423, "kids": [{"by": "ericflo", "id": 22509148, "kids": [{"by": "ac29", "id": 22509392, "kids": [{"by": "ericflo", "id": 22509534, "text": "&gt; I could certainly install MinIO (a S3 compatible object store) on a home NAS and charge people for it<p>But how would that work? You&#x27;d probably make a website or app that had users sign up for an account, and then with that account they could associate payment information from a payment processing company, and then you&#x27;d provide them with credentials where they could log in to their Minio instance. Right?<p>Then, you have to go out and market your service, explain to people why they should use it instead of existing alternatives, convince people that you&#x27;re trustworthy, build a reputation, and generally do sales.<p>In the case of Sia, you build your host, plug it in, announce it to the Sia blockchain, and then clients from all around the world start paying to use your storage.<p>Clients don&#x27;t have to register for an account first, don&#x27;t have to involve a third-party payment processing company, and don&#x27;t need a sales pitch because they algorithmically test, measure, and rank hosts.<p>I remember at the outset of the web, a new thing was this user demand for services to become &quot;self-serve&quot;, as in, you would no longer need to talk to a salesperson and establish a relationship in order to buy something — even something custom. I see this as the next step of that, where you want to be able to programmatically and algorithmically establish and dissolve those kinds of service agreements.", "time": 1583551658}], "text": "&gt; It&#x27;s more so that anyone can join the network as a host. They don&#x27;t have to have a financial or business relationship with anyone, they can just provide their storage service and charge for it. No way to do that currently in the world without a blockchain.<p>Maybe I misunderstand your point, but I could certainly install MinIO (a S3 compatible object store) on a home NAS and charge people for it without using a blockchain. I see your point about not having a financial or business relationship with a blockchain network acting as an intermediary, but I can assure you that the IRS and various law enforcement and regulatory agencies would tell you that you absolutely do have a financial and business relationship with whoever is paying you via the crypto-network whether you&#x27;d like to or not.", "time": 1583549421}], "text": "&gt; but it cannot be true, right? It&#x27;s just what they promise in the hypothetical future, not current price-tag?<p>Here&#x27;s the live pricing, right now: <a href=\"https:&#x2F;&#x2F;siastats.info&#x2F;storage_pricing\" rel=\"nofollow\">https:&#x2F;&#x2F;siastats.info&#x2F;storage_pricing</a><p>&gt; Is it cheaper to implement it on blockchain than by conventional means?<p>It&#x27;s more so that <i>anyone</i> can join the network as a host. They don&#x27;t have to have a financial or business relationship with anyone, they can just provide their storage service and charge for it. No way to do that currently in the world without a blockchain.", "time": 1583545396}], "text": "I don&#x27;t know anything about the subject, so no idea if these claims are realistic. But whatever, either they deliver or they don&#x27;t.<p>My (or their, actually) problem is I don&#x27;t really get what they are offering right now. There is an impressive landing page with big numbers and pretty pictures which explains pretty much nothing. Project seems to be in production for at least 3 years, there are some apps, but I don&#x27;t actually see if I can use it to backup&#x2F;store some data and how much it costs right now. I mean, they say &quot;1TB of files on Sia costs about $1-2 per month&quot; right there on the main page, but it cannot be true, right? It&#x27;s just what they promise in the hypothetical future, not current price-tag?<p>The only technical question I&#x27;m interested here is why they actually need blockchain? This is always suspicious and I don&#x27;t remember if I saw <i>any</i> startup at all that actually needs it for things other than hype. It is basically their internal money system to enable actual money exchange between storage providers and their customers, right? So, just a billing system akin to what telecom and ISP companies have? Is it cheaper to implement it on blockchain than by conventional means? How so?", "time": 1583537869}, {"by": "standardUser", "id": 22506984, "kids": [{"by": "toomuchtodo", "id": 22507046, "kids": [{"by": "reaperducer", "id": 22507117, "kids": [{"by": "toomuchtodo", "id": 22507125, "text": "I don&#x27;t disagree Azure is hot garbage, just listing for completeness. S3 and Backblaze B2 are my go-to object stores.", "time": 1583527397}], "text": "I&#x27;d drop Microsoft from that list because the request for for something &quot;reliable.&quot;<p>It&#x27;s reliable enough, if you can get it to Microsoft&#x27;s cloud.  But for the last six months I&#x27;ve struggled putting very large files into Azure, using five different connections from five different providers in three locations.  Small files are no problem.  But large ones take two, three, or four tries.", "time": 1583527314}, {"by": "BrandonY", "id": 22508436, "kids": [{"by": "toomuchtodo", "id": 22508508, "kids": [{"by": "BrandonY", "id": 22508530, "kids": [{"by": "toomuchtodo", "id": 22508583, "text": "Brilliant! Thank you again!", "time": 1583539552}], "text": "There is also a lower bound of 0 bytes :)<p>You can compose a 4TB object with a 1 byte object, or you can compose 32 150GB objects, just so long as the destination object doesn&#x27;t go over 5 terabytes.", "time": 1583538946}], "text": "Thank you so much! Is there a limit on size of objects besides the 5TB max described in the docs, similar to other object stores where multiparts have lower limits than the total composed object?", "time": 1583538790}], "text": "Hi, GCS engineer here. The lower limit on composing objects is one source object, in which case you are not so much composing as you are copying with style. Zero source objects is an error. I will file a note about the docs, thanks.", "time": 1583538015}, {"by": "khc", "id": 22507177, "text": "S3 max single object size is 5TB. The 5GB limit is for single part upload API. You can use the multi-part API to upload single object in multiple parts.", "time": 1583527769}], "text": "Any object storage system (S3, Backblaze B2, Azure Blob, GCP) should be able to handle those file sizes with proper chunking into smaller parts (limit details below per object store).<p>S3: <a href=\"https:&#x2F;&#x2F;docs.aws.amazon.com&#x2F;AmazonS3&#x2F;latest&#x2F;dev&#x2F;mpuoverview.html\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.aws.amazon.com&#x2F;AmazonS3&#x2F;latest&#x2F;dev&#x2F;mpuoverview....</a> (Max object size: 5TB, Max single multipart size: 5GB)<p>Backblaze B2: <a href=\"https:&#x2F;&#x2F;www.backblaze.com&#x2F;b2&#x2F;docs&#x2F;large_files.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.backblaze.com&#x2F;b2&#x2F;docs&#x2F;large_files.html</a> (Max file size: 10TB, Max single object size: 5GB)<p>Azure: <a href=\"https:&#x2F;&#x2F;docs.microsoft.com&#x2F;en-us&#x2F;rest&#x2F;api&#x2F;storageservices&#x2F;understanding-block-blobs--append-blobs--and-page-blobs\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.microsoft.com&#x2F;en-us&#x2F;rest&#x2F;api&#x2F;storageservices&#x2F;un...</a> (Max file size: 4.75 TB, Max single block size: 100MB)<p>Google: <a href=\"https:&#x2F;&#x2F;cloud.google.com&#x2F;storage&#x2F;quotas\" rel=\"nofollow\">https:&#x2F;&#x2F;cloud.google.com&#x2F;storage&#x2F;quotas</a> (Max file size: 5TB, doesn&#x27;t appear there is a lower limit for objects to be composed into a single object, docs could be better in this regard)<p>@khc: Terminology updated to be more clear for S3", "time": 1583526711}, {"by": "rsync", "id": 22507633, "kids": [{"by": "mkl", "id": 22507980, "text": "Looks like HN ate the * characters in<p><pre><code>  2**64\n</code></pre>\n16 exbibytes is 2^64 bytes.", "time": 1583534016}], "text": "&quot;On a related topic, I&#x27;ve had a ton of problems finding a cloud storage system that will reliably handle files around 100-200gb. Does anyone have a recommendation for a service that can handle that file size with ease?&quot;<p>rsync.net gives you an empty, ZFS filesystem that you can do anything you like with.[1]<p>I believe the file-size limit is 16 exbibytes (264 bytes).<p>rsync.net can also talk to <i>every cloud storage provider</i>[2] because rclone[3] is built into the platform:<p><pre><code>    ssh user@rsync.net rclone s3:&#x2F;some&#x2F;bucket rsync&#x2F;home&#x2F;dir\n</code></pre>\n[1] <a href=\"http:&#x2F;&#x2F;rsync.net\" rel=\"nofollow\">http:&#x2F;&#x2F;rsync.net</a><p>[2] <a href=\"https:&#x2F;&#x2F;www.rsync.net&#x2F;products&#x2F;universal.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.rsync.net&#x2F;products&#x2F;universal.html</a><p>[3] <a href=\"https:&#x2F;&#x2F;rclone.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;rclone.org&#x2F;</a>", "time": 1583531180}, {"by": "Taek", "id": 22507375, "text": "Sia, the system described above, comfortably handles files of 100-200 gb, and with the recent Skynet link also enables filesharing for files up to 400 GB.", "time": 1583529365}, {"by": "brian_herman__", "id": 22507027, "text": "Have you tried amazon s3? What is your use case? Can you elaborate?\nedit:Grammar", "time": 1583526609}], "text": "On a related topic, I&#x27;ve had a ton of problems finding a cloud storage system that will reliably handle files around 100-200gb. Does anyone have a recommendation for a service that can handle that file size with ease?", "time": 1583526271}, {"by": "servercobra", "id": 22508020, "text": "So no CPU (or APU, so you don&#x27;t need a GPU), no RAM, and those breakout cables are actually for SAS, but no SAS card listed in the total. This does not inspire confidence in the project at all.", "time": 1583534306}, {"by": "imhoguy", "id": 22507528, "text": "Interesting article, but &quot;black swan situations like world war three&quot; may be underestimation. Software bugs are more likely and sometimes fatal.<p>I wonder why transfer prices are not included? As you explain every transfer is paid does it mean one has to pay for 10 uploads of every single object, right? But as equipment ages, peers go out of business then who pays for the data rebalancing transfers?", "time": 1583530441}, {"by": "pedrocr", "id": 22507102, "kids": [{"by": "Kliment", "id": 22507305, "kids": [{"by": "nh2", "id": 22512055, "text": "Hetzner&#x27;s dedicated storage servers cost ~180 $&#x2F;month for 100 TB storage:<p><a href=\"https:&#x2F;&#x2F;www.hetzner.de&#x2F;dedicated-rootserver&#x2F;matrix-sx?country=us\" rel=\"nofollow\">https:&#x2F;&#x2F;www.hetzner.de&#x2F;dedicated-rootserver&#x2F;matrix-sx?countr...</a><p>That is pretty close to the $2 per TB per month from the article (assuming the same factor 1.5 replication they have planned), while also providing 128 GB ECC RAM, enterprise disks, and 24&#x2F;7 phone support.", "time": 1583595499}, {"by": "pedrocr", "id": 22507366, "kids": [{"by": "mallets", "id": 22509123, "kids": [{"by": "pedrocr", "id": 22510520, "text": "That&#x27;s starting to look quite interesting, thanks! 5TB of rsyncable storage for 22€&#x2F;month could definitely replace one of my NAS boxes. The 10 concurrent connections are the only big limitation really. Not being able to run my own stuff is also not ideal. But it&#x27;s the kind of thing I&#x27;ve envisioned to stop using a NAS and just point syncer at:<p><a href=\"https:&#x2F;&#x2F;github.com&#x2F;pedrocr&#x2F;syncer&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;pedrocr&#x2F;syncer&#x2F;</a>", "time": 1583569085}], "text": "Check out their storage box if using their cloud instances. <a href=\"https:&#x2F;&#x2F;www.hetzner.com&#x2F;storage&#x2F;storage-box?country=ot\" rel=\"nofollow\">https:&#x2F;&#x2F;www.hetzner.com&#x2F;storage&#x2F;storage-box?country=ot</a><p>€10 for 2TB and unlimited transfer within same datacenter (or 10TB if accessing from outside). You will get a 1Gbps or more transfer speed and many options for mounting the storage (SCP, webdav, etc). I used to use them as a intermediate backup location when I used their cloud instances and dedi servers.", "time": 1583545115}], "text": "From what I can see on the website that block storage consists of SSDs priced at ~50€&#x2F;month&#x2F;TB which is a non-starter. The cloud instances are incredibly cheap though, I may have a look at those.", "time": 1583529267}], "text": "Hetzner&#x27;s super cheap &quot;cloud&quot; machines allow you to attach &quot;block storage&quot; volumes of whatever size you like. It&#x27;s not particularly well advertised (searching for this sort of thing takes you to their dedicated storage offerings) but it&#x27;s there and it&#x27;s great.", "time": 1583528864}], "text": "It&#x27;s probably feasible to reach these levels of cost. I certainly still keep NAS in two locations because even places like hetzner don&#x27;t sell lower powered machines with lots of disk space. But the build they specify doesn&#x27;t have a CPU or RAM and it&#x27;s using a SAS cable to connect to a SATA motherboard. Depending on the requirements of the platform they may be able to get away with non-ECC RAM, a simple APU to not need a graphics card, and a few cheap SATA PCIe cards to get enough connections. It will probably add ~500$ or ~10% to the build though. I don&#x27;t know if the other costs have similar issues.", "time": 1583527139}, {"by": "ds", "id": 22510948, "kids": [{"by": "ds", "id": 22511192, "kids": [{"by": "sho", "id": 22512167, "text": "&gt; Also, why is this a cryptocurrency at all?<p>Do you even need to ask? Because they have minted a bunch of SIA coin and this is their effort to give it value out of thin air, making them all millionaires. Using someone else&#x27;s currency, despite its obvious benefits, means no huge pre-minted pool under their control = no lambos.<p>Every single ICO project is like this.", "time": 1583596663}], "text": "So I did a quick look and it seems like the total usage of siacoin is not that large.<p><a href=\"https:&#x2F;&#x2F;siastats.info&#x2F;hosts_network\" rel=\"nofollow\">https:&#x2F;&#x2F;siastats.info&#x2F;hosts_network</a>  Only 710 TB is in use. Or about $20k worth of hardware TOTAL for the entire network, according to the above URL.<p>Also, why is this a cryptocurrency at all? Wouldnt this business be drastically simplified by simply paying people out&#x2F;&#x2F;letting people rent space with either USD or bitcoin?", "time": 1583582853}], "text": "The most important thing not addressed here is demand. Last I checked (granted, this was a while ago) it simply wasnt there- Meaning if you built this rig you might only be able to rent out a small part of it.<p>If this has changed I would be interested in hearing about it-<p>One other thing I am not understanding is how this makes  financial sense, even if the demand is there. If I am buying a rig for 4500 bucks to get 200TB, making &quot;570 a year in profit&quot; is nowhere near exciting enough. Practically any other use pays more. Renting a dedicated server for a game, web hosting, hell even GPU mining makes more.<p>(a single 1080ti can do about 1$ a day in gross revenue on grin&#x2F;eth&#x2F;etc - which can be had used for ~400 bucks- Or you can get a p102 which is the mining card version with no display output for 250 bucks) - Payback with power costs&#x2F;etc.. well below the 10 year threshold of siacoin)<p>Now where it might be interesting (IF there is demand), is just adding harddrives to an existing infrastructure already in place. So if you are a GPU miner and have 1000 rigs already in place, just adding a single 4TB harddrive to each machine might not be too bad- They go for about $50 each used and according to this, will pay back $8 a month with minimal extra costs", "time": 1583577675}, {"by": "rcar", "id": 22506980, "text": "I was expecting an ad based on the title, but it ended up being an interesting analysis of just how much storage ends up costing them with their focused hardware setup.", "time": 1583526259}, {"by": "franciscop", "id": 22510745, "kids": [{"by": "drak0n1c", "id": 22510840, "text": "Until payment processing for regular money becomes free, peer-to-peer micropayments can only be done economically with a cryptocurrency. The need for a new unique crypto currency for this project is debatable, but I can understand that the people who work on this project full-time need to earn a paycheck.", "time": 1583575040}], "text": "The website seemed okay and even useful until:<p>&quot;Both renters and hosts use Siacoin, a unique cryptocurrency built on the Sia blockchain. Renters use Siacoin to buy storage capacity from hosts, while hosts deposit Siacoin into each file contract as collateral.&quot;", "time": 1583572618}, {"by": "prophesi", "id": 22507832, "kids": [{"by": "Taek", "id": 22508409, "text": "The target audience is people who are concerned that Sia&#x27;s long term economic story is fragile, and can&#x27;t survive beyond what underutilized storage exists today.<p>The types of farms described in the article are what I imagine Sia to look like 10 years from now, not something we expect to spin up in the next 18 months.", "time": 1583537785}, {"by": "NKosmatos", "id": 22507935, "text": "Exactly. I assume they’re targeting the “big guns” that can spend&#x2F;invest money in order to build a Sia data center and then get a return out of it. I had a raspberry running Sia for a couple of months and made nothing out of it :-(\nWhen I originally heard&#x2F;read about Sia I had the optimistic view that many of us users would power their network, where in fact only a few ones exist (~350).\nSee <a href=\"https:&#x2F;&#x2F;siastats.info\" rel=\"nofollow\">https:&#x2F;&#x2F;siastats.info</a> for more details.", "time": 1583533722}, {"by": "Hamuko", "id": 22507882, "kids": [{"by": "prophesi", "id": 22507936, "kids": [{"by": "aschatten", "id": 22508550, "kids": [{"by": "prophesi", "id": 22513864, "text": "I wouldn&#x27;t try hosting on Sia if you&#x27;re trying to make a profit. I spent 20USD on Sia currency. And I didn&#x27;t go out and purchase a RPi + harddrive for it. You likely wouldn&#x27;t make a profit if you did. RPi&#x27;s are great for costing next to nothing in electricity, though.", "time": 1583613417}], "text": "Can you share more info on cost breakdown and earnings? Also, how expensive is electricity in your area?", "time": 1583539181}], "text": "For the first few months, you&#x27;ll basically have all of your Sia drained as your contracts start coming in and your host wallet gives them collateral. But yeah, my contracts only recently started to complete, and I&#x27;ve got the amount of Sia I started with at the very least.<p>So... Yes, but probably not very much? Particularly when accounting for the price drop in Sia.<p>Edit: If you do decide to host, it&#x27;ll likely be about 5-6 months before your contracts start completing if your host settings go by the recommended 26 week max duration. And don&#x27;t go out buying hardware unless you&#x27;re in it for the long run, which makes me now realize the point of this article.", "time": 1583533727}], "text": "Do you make anything from it?", "time": 1583533246}], "text": "Honestly, I&#x27;m a bit confused on who the targeted audience is for this article. I&#x27;ve been running as a host for Sia for months now. My rig is a raspberry pi and a 10tb external HDD I had laying around.", "time": 1583532780}, {"by": "dnprock", "id": 22507870, "text": "I worked for a p2p startup 15 years ago. We were exploring ideas and products in this space. We came close to partnering with a company doing distributed cloud storage. Their idea was to allow people to rent storage space in personal computers.<p>We decided to scrap the plan to do p2p storage, ended up using cloud storage. This p2p storage idea is a tough one. People are not willing to make a few dimes renting out their hard drive or CPU. The economic unit is too small to work. But good luck trying this idea. I wouldn&#x27;t be surprised if someone tries again in 20 years. :)", "time": 1583533142}, {"by": "mjb", "id": 22507138, "kids": [{"by": "Taek", "id": 22507365, "kids": [{"by": "wmf", "id": 22507446, "text": "It&#x27;s fine from the perspective of a single request but it seems like it reduces the overall throughput of the network. If Sia has, say, 1M hard disks and can do 100M raw IOPS then 10-of-30 gives 10M net IOPS but 64-of-96 gives only 1.5M net IOPS.", "time": 1583529830}], "text": "Each of the 64 pieces is fetched from a different host on the network, meaning all of the IOPS are happening in parallel at network speeds. You aren&#x27;t going to be doing sub-millisecond updates for sure, but you can easily get under 100ms.<p>The reed-solomon also isn&#x27;t even the most computationally expensive part, the computationally expensive part is computing and verifying the Merkle roots. All parts of the system though can go &gt;1gbps on standard CPUs.", "time": 1583529266}], "text": "The IO operations amplification for 64 of 96 is pretty brutal, and particularly unfavorable in a world where capacity-per-IOPS keeps trending up. I wonder how they&#x27;ll deal with that.", "time": 1583527484}, {"by": "miohtama", "id": 22507773, "text": "See also Tardigrade<p><a href=\"https:&#x2F;&#x2F;tardigrade.io&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;tardigrade.io&#x2F;</a><p>It is $10&#x2F;mo&#x2F;TB, but has different uptime, speed and security characteristics.", "time": 1583532318}, {"by": "rob-olmos", "id": 22507187, "kids": [{"by": "Tepix", "id": 22507219, "kids": [{"by": "zaroth", "id": 22507709, "kids": [{"by": "tracker1", "id": 22507818, "kids": [{"by": "zaroth", "id": 22508900, "kids": [{"by": "tracker1", "id": 22510670, "kids": [{"by": "hddherman", "id": 22511065, "text": "&gt; 48 PCIe lanes<p>PCIe lane count depends on CPU support, for AM4 I believe it ranges from 6x PCIe 3.0 (cheapest AMD Athlon&#x2F;Ryzen CPU-s with integrated GPU) to 24 (PCIe 4.0 for latest Zen 2 based Ryzen 3000 series).<p>The CPU they list in the article supports 16 lanes of PCIe 3.0 connectivity + 4 lanes for chipset (storage and other IO). Nowhere near the 48 PCIe lanes you mention, although you could argue that 20+4 lanes of PCIe 4.0 bandwidth is equal to 48 lanes of PCIe 3.0 bandwidth, but this would require a compatible CPU, which would increase the cost by hundreds of dollars.", "time": 1583579759}], "text": "They mention 8 pcie slots with 48 pcie lanes... I&#x27;m presuming they are filling them with sas&#x2F;sata controllers.", "time": 1583571165}], "text": "They do link to the motherboard they are talking about, and it doesn&#x27;t have SAS.", "time": 1583542531}], "text": "it&#x27;s probably a SAS&#x2F;Sata controller, and the sas interface split to 4x sata.", "time": 1583532658}], "text": "&gt; Using &quot;8x 4 way SATA data splitters&quot;.<p>There&#x27;s no such thing as a passive SATA data splitter.", "time": 1583531808}, {"deleted": true, "id": 22508985, "time": 1583543646}, {"by": "pbhjpbhj", "id": 22507577, "text": "6TB might be the most reliable at the time the decision was made.", "time": 1583530757}], "text": "Using &quot;8x 4 way SATA data splitters&quot;.<p>What i don&#x27;t get is why they don&#x27;t use 14TB HDDs, they are only 15% more expensive per TB. On the other hand they&#x27;d need 2.33x less PCs at $550 each, plus their power use.<p>So instead of every 7 PCs with 6TB HDDs they&#x27;d need 3 with 14TB HDDs.<p>PS: They could also use a mainboard with 10 SATA ports instead of 8. They are only $15 more than the chosen board. Adding one or more PCIe 8x SATA controller cards might also make sense, depending on the average load of a system.", "time": 1583528208}, {"deleted": true, "id": 22508714, "time": 1583540646}], "text": "How did they go from 8 SATA ports to 32 SATA devices? The linked cable uses a SAS host&#x2F;connector. Was a SAS card left out of the parts list?", "time": 1583527850}, {"by": "rishabhd", "id": 22516546, "text": "Offtopic question : I went through their website, and I have no idea about blockchain. I have gone through the documentation and almost everything they are doing is possible without it as well. Cryptoproofs for storing data, smart contracts et al - not sure if it is different from regular encrypted deduplication done regularly with standard per hour&#x2F; per minute billing. Also, Siacoin for payment, not sure if it is the most optimal way. \nI think I am missing something, would be glad if someone can point me in the right direction.", "time": 1583646541}, {"by": "londons_explore", "id": 22510676, "text": "This tech seems very cool, but with only 200TB stored I worry that it is destined to not pay for its overheads.   No big project can survive on a revenue of $20&#x2F;month!<p>When will the project grow some mobile apps like Dropbox or Google drive that you can just put a credit card number into, pay a few bucks and know your data is safe?", "time": 1583571284}, {"by": "Mave83", "id": 22507459, "text": "We from croit.io operate Ceph based storage including everything from datacenter, power, switches, labor, licenses, all to a price point of 3€&#x2F;TB.<p>No consumer ware", "time": 1583529930}, {"by": "ianopolous", "id": 22508764, "kids": [{"by": "paulsutter", "id": 22508799, "kids": [{"by": "ianopolous", "id": 22508834, "kids": [{"by": "paulsutter", "id": 22508852, "kids": [{"by": "ianopolous", "id": 22508941, "kids": [{"by": "paulsutter", "id": 22508994, "text": "We lost drives all the time. In fact we moved so much data we needed checksums to avoid the 1e-13 undetected data errors.<p>We seriously did do the calculations (done by serious PhDs) and we seriously did not lose data.<p>I’m sure you are imagining a system that doesn’t work. But that doesn’t mean only a raidlike setup can work.<p>And by the way, could you explain how to calculate chance of data loss without taking recovery time into account?", "time": 1583543697}, {"by": "ianopolous", "id": 22509037, "kids": [{"by": "ianopolous", "id": 22509224, "text": "It boils down to the following:<p>You can calculate a probability L of losing a given file.<p>Because we&#x27;ve assumed totally uncorrelated failures that means this is the same for all files, and that the probability of losing NO files if you have T files is (1 - L)^T<p>As you can see, this approaches 0, meaning Pr(losing a file) approaches 1 as T increases.<p>Using the probability of file loss in Sia, which I would say is is too low, but lets ignore that. They get L = 10^-19.<p>This leads to T = ~10^19 before you expect to lose data. If you&#x27;re erasure coding on the byte level, then that&#x27;s 10 exa bytes.<p>I expect your probability of failure is much less than random nodes on a distributed global network of volunteers. so yes, ~petabyte is below the threshold, but there is a threshold.", "time": 1583546585}], "text": "To clarify, the assumptions I&#x27;m making for the calculation are:<p>1) a Fixed probability of a server failing<p>2) a fixed erasure coding scheme used for all files<p>3) uncorrelated server failures<p>4) an erasure fragment is stored on a random server", "time": 1583544103}], "text": "No need to be rude. EDIT: The offensive part was removed<p>What was the probability of failure of your drives? My guess is you just didn&#x27;t hit the threshold for your failure rate. The maths checks out (PhD here). Seriously, do the calculation.", "time": 1583543155}], "text": "We stored hundreds of petabytes on cheap SATA drives with random fragment placement using reed solomon 6+3 coding (half the space of 3 replicas but same durability). Never lost a byte.<p>Speed of recovery is crucial, because that’s your window of vulnerability to multiple failures. For example. try raid 5 on giant drives. The chances of losing a second drive during recovery is very likely.", "time": 1583542150}], "text": "I didn&#x27;t say anything about speed of recovery because it&#x27;s not relevant. Recovery can&#x27;t happen at all if enough fragments aren&#x27;t online. The maths says that with unncorelated fragment placement, and thus uncorrelated failures, and with enough data, you are basically guaranteed to lose data. Try doing the maths for an entire filesystem, where each file&#x2F;block is individually erasure coded.", "time": 1583541832}], "text": "totally false<p>ordinary raid has very slow recovery because it’s concentrated on a hot spot of a new drive. plus recovery waits for a new drive to be inserted (double stupid).<p>when fragment placement is randomized, recovery is widely distributed and can happen in less total time so lower chance of data loss.", "time": 1583541476}], "text": "There is one big problem that I&#x27;ve not seen anyone else point out with systems like this. I know because I did the calculation early on with Peergos and came to the conclusion that it doesn&#x27;t work.<p>The problem comes when you want to store multiple files. If the corresponding erasure code fragments from different files are not stored on the same server then you don&#x27;t have correlated failures. Contrast this with a typical raid scheme where a failed drive means the nth erasure fragment of every file is gone  - correlated failures. If the failures across different files are not correlated, which is the case if you&#x27;re storing each new block on a random node, then you are basically guaranteed to lose data if you have enough files. Depending on your scheme, this can happen as low as 1 TiB of data for a user. It is similar to the birthday paradox.<p>For erasure codes to work for a filesystem you need to have correlated failures.", "time": 1583541108}, {"by": "vinniejames", "id": 22508721, "text": "This is pretty incredible both from a product perspective, as well as the potential to push the whole industry towards a race to the bottom. Equilibrium here pushes storage, processing, and availability towards distributed nodes, unless high availability is required for some unique business case", "time": 1583540690}, {"by": "vondur", "id": 22508523, "text": "That rack setup in the article reminds me of Gilfoyle&#x27;s setup for Anton in the garage from Silicon Valley.", "time": 1583538895}, {"by": "people42", "id": 22511594, "text": "For people that use Plex... Do you think that it&#x27;s a good place ? If we have several TB is it cheaper to use it&#x27;s own PC with (let&#x27;s say) 2x10TB HDD + 2x10TB HDD backup or it&#x27;s better to go online today ? When I check the price, I feel that it&#x27;s always more expansive.<p>For my backup, it&#x27;s not sync in real time but I do manual backup every 3 months. I can loose some data but I feel ok with that.", "time": 1583590348}, {"by": "aiisjustanif", "id": 22509467, "text": "You lost me on the homepage (sia.tech) there are only 895 hosts storing a total of 206TB right now. That coupled with the shady infrastructure.<p>You aren’t touching my enterprise data, not even the cold storage logs.", "time": 1583550526}, {"by": "johnchristopher", "id": 22511920, "text": "I wish there was an easy solution that would allow me to plug an S3 or a virtual drive or whatever and mount it as a partition in my cheap 20gb VPS.<p>The price for additional “drive”, like 5 bucks per month for 50gb or sthg, is insane. Especially when comparing with Dropbox or Onedrive pricing (or even physical drives sold over the counter).", "time": 1583594277}, {"by": "zhte415", "id": 22510766, "text": "The website sia.tech required a Google captcha challenge for me to even load, clicking through from the article.<p>So.. that turned me off in an instant.", "time": 1583573062}, {"by": "zupa-hu", "id": 22513384, "kids": [{"by": "zupa-hu", "id": 22513404, "text": "To elaborate, while I like such optimization efforts, for this to work you&#x27;d need to run your own datacenter because the _ones I have found_ that offer cheap bandwidth require IPMI (to lower their labor costs).<p>Or you need to know some providers I don&#x27;t know, in which case, tell me. :)", "time": 1583608647}], "text": "Does any consumer grade motherboard have IPMI* support? When I tried to optimize my server costs one issue I ran into was that colocation providers require IPMI capability, which seems only available in server-grade motherboards.<p>* IPMI is for remote hardware management", "time": 1583608382}, {"by": "rwbaskette", "id": 22509303, "text": "Where are these datacenters? I live in Ohio in the area of two of the points on the home page at <a href=\"https:&#x2F;&#x2F;sia.tech&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;sia.tech&#x2F;</a> One appears to be a private residence or a farm. The other dot is literally on a golf course fairway, is a private residence, or a power substation.", "time": 1583548084}, {"by": "flatiron", "id": 22507548, "kids": [{"by": "pedrocr", "id": 22507843, "kids": [{"by": "flatiron", "id": 22527445, "text": "they say you need 5 people but its just me and i pay $12", "time": 1583775171}], "text": "Where are you getting that price? Google Drive is 300$+ for that and GCP archive storage is 140$.<p>Edit: apparently that&#x27;s the unlimited storage in GSuite for 12$&#x2F;month&#x2F;user as long as you have 5 users or more.", "time": 1583532861}, {"by": "tracker1", "id": 22507805, "text": "They make it up with the dozens paying $12&#x2F;month and only using 8gb.", "time": 1583532575}], "text": "I have no clue how google stores my 35TB for $12 a month. They do at a loss and I guess they don’t really care.", "time": 1583530563}, {"by": "tgsovlerkhgsel", "id": 22508915, "kids": [{"by": "markc", "id": 22510136, "kids": [{"by": "tgsovlerkhgsel", "id": 22514919, "text": "I think it&#x27;s a lot more comparable to cold storage than to anything else. I assume you cannot serve directly from Sia? How long does recovery take?<p>(Does anyone know how long Scaleway takes in practice? They claim minutes but I haven&#x27;t used them yet.)", "time": 1583622611}], "text": "Sia isn’t cold storage.", "time": 1583562311}], "text": "I expected this title to be about <a href=\"https:&#x2F;&#x2F;www.scaleway.com&#x2F;en&#x2F;c14-cold-storage&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.scaleway.com&#x2F;en&#x2F;c14-cold-storage&#x2F;</a> which already offers exactly that, Cloud storage for $2 per TB per month.", "time": 1583542803}, {"by": "kalium_xyz", "id": 22508668, "text": "I just saw IBM claiming to do 10TB at zero cost on twitter, how are you guys gonna beat that?", "time": 1583540291}, {"by": "execve12", "id": 22508821, "kids": [{"by": "kllrnohj", "id": 22508997, "text": "Staggered spin-up is a thing. That motherboard doesn&#x27;t have it most likely, but they also can&#x27;t plug 32 HDDs into it either. They&#x27;d need an HBA card of some kind, which is more likely to have staggered spin-up.", "time": 1583543741}], "text": "&gt; It also turns out that 32 HDDs only consume 200w, so the 750w PSU we picked is more than sufficient.<p>Yep. Stopped reading right there. HDDs use ~15 watts when they boot up. I experienced this and I never allocate less than 20 watts &#x2F; hard disk.", "time": 1583541653}, {"by": "OJFord", "id": 22507982, "kids": [{"by": "Taek", "id": 22508432, "text": "<a href=\"https:&#x2F;&#x2F;siastats.info&#x2F;storage_pricing\" rel=\"nofollow\">https:&#x2F;&#x2F;siastats.info&#x2F;storage_pricing</a><p>It&#x27;s less than $2 &#x2F; TB &#x2F; Mo today, but relies on a completely different set of economics that don&#x27;t scale beyond a few hundred PB. This article was aimed at people who understand why Sia is so cheap today, but do not believe that Sia will continue to be cheap as the network scales.", "time": 1583537964}, {"by": "gazelle21", "dead": true, "id": 22508071, "text": "Thank you, I feel like I was going crazy reading it.<p>&quot;Look how awesome the future is&quot;", "time": 1583534659}], "text": "&gt; over the long term, storage will be cheaper than $2 &#x2F; TB &#x2F; Mo<p>OK, but what is it today?", "time": 1583534030}, {"by": "Aunche", "id": 22508209, "kids": [{"by": "Mave83", "id": 22510634, "text": "Yes, but with croit.io you can manage Ceph clusters with ease, reducing Laber costs and increase reliability.<p>We build clusters of low PB scale that have a TCO with everything from labor to hardware, from financing to electric, from routers to cables and can be run below 3€&#x2F;TB. For that you can store data in Block(rbd, iscsi), Objekt(S3, swift) or Filestorage(CephFS, NFS, SMB), high available on Supermicro hardware in any datacenter worldwide.<p>Feel free to contact us or use our free community edition to start your own cluster.", "time": 1583570582}], "text": "In addition to what other people mentioned, there is also a huge cost in managing all the metadata that you&#x27;d get from billions of files. This really even worse if you&#x27;re using a crazy 64-32 encoding.", "time": 1583535937}, {"by": "crobertsbmw", "id": 22511930, "text": "I was sexcotes to cancel all my storage subscriptions, but for some reason this article didn’t convince me that that was an option yet.", "time": 1583594367}, {"by": "irishcoffee", "id": 22506982, "text": "This makes me want to buy storage just because I know exactly how it’s spent.", "time": 1583526262}, {"by": "QuinnyPig", "id": 22509112, "text": "I wonder what it would take to build a frontend for this that uses other people’s exposed S3 buckets for storage.", "time": 1583545036}, {"by": "jsight", "id": 22509456, "text": "So, $48 USD&#x2F;year for 2TB? That&#x27;s a little less than idrive, as they charge ~70&#x2F;year for 2TB.", "time": 1583550338}, {"by": "classics2", "id": 22508416, "text": "one thing that bothers me about this system beyond the hand waving math is what would motivate me to give up control of my data being available?  If I have no SLA and no ability to convince a bunch of down hosts to come back online with my data, why store it that way at all?", "time": 1583537810}, {"by": "dillydobby", "id": 22507684, "kids": [{"by": "entangledqubit", "id": 22507900, "kids": [{"by": "mtnGoat", "id": 22508944, "text": "yet a number of FAANGs have datacenters full of mismatched lease returns. So it much make sense at some scale.", "time": 1583543229}], "text": "I would imagine that managing such a pool of dated and highly heterogeneous hardware would incur a lot of overhead.  The procurement effort may end up being rather high as well.", "time": 1583533361}], "text": "I wouldn&#x27;t even buy new hardware. I would buy retired hardware for a fraction of the price.", "time": 1583531571}, {"by": "hestefisk", "id": 22508475, "text": "Looks super interesting. Can anyone who has used it share their experience?", "time": 1583538430}, {"by": "riffic", "id": 22507127, "kids": [{"by": "kazen44", "id": 22507161, "kids": [{"by": "galeaspablo", "id": 22507847, "text": "Increasing redundancy and uptime to the next factor of nines is exponentially* more expensive.", "time": 1583532901}], "text": "Availability is the big one. Getting high availability makes systems incredibly more complex and expensive.<p>It&#x27;s the same reason increasing redundancy and uptime to the next factor of nines is almost logarithmatically more expensive.", "time": 1583527678}, {"by": "doobiedowner", "id": 22507172, "text": "The shelf is made of a durable real-looking wood laminate!", "time": 1583527732}], "text": "Durability? Availability?", "time": 1583527398}, {"by": "cjohansson", "id": 22511094, "text": "This sounds interesting, thanks for sharing!", "time": 1583580521}, {"deleted": true, "id": 22508555, "time": 1583539268}, {"by": "Proven", "dead": true, "id": 22509225, "text": "Just make sure you make a backup on S3.<p>Oh, wait...", "time": 1583546588}, {"by": "wildchild", "dead": true, "id": 22510531, "text": "Shitcoiners can gtfo.", "time": 1583569265}, {"by": "britmob", "id": 22507195, "text": "Great writeup from David as always. Can’t wait to see more!<p>If anyone hasn’t seen the work being done on the skynet platform, I highly recommend taking a look. Amazing stuff.", "time": 1583527902}], "score": 651, "time": 1583524667, "title": "Cloud Storage for $2 per TB per month", "url": "https://blog.sia.tech/cloud-storage-for-2-tb-mo-8a34043e93bb"}